[
    {
        "scene" : -1,
        "has_quest" : false,
        "audio" : "bgm-emotion_understanding-sc_00_01_02",
        "background" : "background_main",
        "intro_en": [
            "You will start a role play in this visual novel style journey as the character 'Pomoro' in the fictional land of Prospevil.",
            "In each of your steps going forward, you will meet another character and will guess their emotion from first glance.",
            "After guessing their emotion from their facial expression and body language, the next step is to select the option that YOU would actually choose if you were in this story.",
            "Enjoy the game, good luck, and have fun!`"
        ],
        "intro_id": [
            "Anda akan memulai permainan peran dalam perjalanan gaya novel visual ini sebagai karakter 'Pomoro' di negeri fiksi Prospevil.",
            "Dalam setiap langkahmu ke depan, kamu akan bertemu karakter lain dan akan menebak emosi mereka dari pandangan pertama.",
            "Setelah menebak emosi mereka dari ekspresi wajah dan bahasa tubuh mereka, langkah selanjutnya adalah memilih opsi yang benar-benar ANDA pilih jika Anda berada di cerita ini.",
            "Nikmati permainannya, semoga berhasil, dan bersenang-senanglah!`"
        ],
        "emotions_en": [],
        "emotions_id": [],
        "response_en": [],
        "response_id": [],
        "response_en_contexts": [],
        "response_id_contexts": []
    },
    {
        "scene": 0,
        "has_quest": false,
        "audio": "bgm-emotion_understanding-sc_00_01_02",
        "background": "bg-sc_00",
        "intro_en":
        [
            "Once upon a time, in a far-off kingdom, there was a young adventurer named Pomoro who is known for his thirst for adventure. He started his journey to Prospevil, a prosperous village in the Kingdom of Vefurata.",
            "Pomoro set out on his journey, feeling excited to embark on this new adventure. To the forest of Vefurata."
        ],
        "intro_id":
        [
            "Alkisah, di sebuah kerajaan yang jauh, ada seorang petualang muda bernama Pomoro yang dikenal haus akan petualangan. Ia memulai perjalanannya ke Prospevil, sebuah desa makmur di Kerajaan Vefurata.",
            "Pomoro memulai perjalanannya, merasa bersemangat untuk memulai petualangan baru ini. Ke hutan Vefurata."
        ],
        "emotions_en": [],
        "emotions_id": [],
        "response_en": [],
        "response_id": [],
        "response_en_contexts": [],
        "response_id_contexts": []
    },
    {
        "scene": 1,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_00_01_02",
        "background": "bg-sc_01",
        "intro_en":
        [
            "As he walked through the forest, Pomoro saw a mushroom humanoid in front of the house."
        ],
        "intro_id":
        [
            "Saat berjalan melewati hutan, Pomoro melihat humanoid jamur di depan rumah."
        ],
        "emotions_en":
        [
            {
                "text": "Unease",
                "score": 25,
                "info": "Feeling a mild sense of discomfort or concern in response to a perceived threat or potential danger. This level of fear is often fleeting and may arise from unfamiliar situations or minor worries."
            },
            {
                "text": "Pronounced Introversion",
                "score": 50,
                "info": "Encountering a significant inclination towards introversion, where social interactions can be challenging and draining. This level of shyness is characterized by a preference  solitude or small groups, a need for ample personal space, and a heightened sensitivity to external stimulation."
            },
            {
                "text": "Moderate Timidity",
                "score": 75,
                "info": "Experiencing a noticeable level of shyness that can impact interactions and self-expression. This level of shyness involves a greater tendency to avoid attention or seek solitude, and may involve feelings of self-doubt, nervousness, or difficulty initiating conversations or asserting oneself."
            },
            {
                "text": "Mild Self Consciousness",
                "score": 100,
                "info": "Feeling a slight discomfort or unease in social situations, particularly when meeting new people or being the center of attention. This level of shyness is relatively low intensity and may manifest as hesitation, blushing, or a preference for observing rather than actively participating."
            }

        ],
        "emotions_id":
        [
            {
                "text": "Gelisah",
                "score": 25,
                "info": "Merasakan rasa tidak nyaman atau kekhawatiran ringan sebagai respons terhadap ancaman yang dirasakan atau potensi bahaya. Tingkat ketakutan ini seringkali cepat berlalu dan mungkin timbul dari situasi yang tidak biasa atau kekhawatiran kecil."
            },
            {
                "text": "Diucapkan Introversi",
                "score": 50,
                "info": "Menghadapi kecenderungan yang signifikan terhadap introversi, di mana interaksi sosial dapat menjadi tantangan dan menguras tenaga. Tingkat rasa malu ini dicirikan oleh preferensi kesendirian atau kelompok kecil, kebutuhan akan ruang pribadi yang luas, dan kepekaan yang meningkat terhadap rangsangan eksternal."
            },
            {
                "text": "Ketakutan Sedang",
                "score": 75,
                "info": "Mengalami tingkat rasa malu yang nyata yang dapat memengaruhi interaksi dan ekspresi diri. Tingkat rasa malu ini melibatkan kecenderungan yang lebih besar untuk menghindari perhatian atau mencari kesendirian, dan mungkin melibatkan perasaan ragu-ragu, gugup, atau kesulitan memulai percakapan atau menegaskan diri sendiri."
            },
            {
                "text": "Kesadaran Diri Ringan",
                "score": 100,
                "info": "Merasa sedikit tidak nyaman atau gelisah dalam situasi sosial, terutama saat bertemu orang baru atau menjadi pusat perhatian. Tingkat rasa malu ini relatif rendah intensitasnya dan dapat bermanifestasi sebagai keragu-raguan, muka memerah, atau preferensi untuk mengamati daripada berpartisipasi secara aktif."
            }    
        ],


        "response_en":
        [
            {
                "text": "Don't pay too much attention and continue the journey",
                "score": 25
            },
            {
                "text": "Ask the mushroom for directions",
                "score": 50
            },
            {
                "text": "Greet the mushroom",
                "score": 75
            },
            {
                "text": "Introduce yourself and ask the mushroom for directions",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro does not pay too much attention to the mushroom and decides to continue on the journey*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ifuly noticed that someone seems to be approaching her, and he ran inside her house."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Greets the mushroom*",
                        "Hi..."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohh, emm.. hi there...",
                        "*Ifuly look so embarrassed and goes inside her house.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Ask for directions.*",
                        "Excuse me, am I on the right direction to Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "... Oh hi, sorry. Can you repeat your question? I wasn’t fully paying attention."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Sure, so I want to go to Prospevil, am I on the right direction?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohhh, Prospevil. I think it's correct, but I'm not sure.",
                        "Maybe you can double check with one of my sisters, they went out a few hours ago."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Introduce yourself and ask for directions*",
                        "Hello there, my name is Pomoro. Am I on the right direction to Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Oh, hi Pomoro.",
                        "Sorry, I didn’t pay full attention. I'm Ifuly by the way. Do you mind repeating your question?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yes, so I want to go to Prospevil, am I on the right direction?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohhh, Prospevil. I think it's correct, but you can double check with my sisters if you meet them",
                        "They’ve been there a lot, I’ve only been there few times"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, may I know what your sisters names are?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "They look similar to me and their names are Bolebole, Agari & Imuc.",
                        "Also say hi from me if you meet them, Pomoro!"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Jangan terlalu memperhatikan dan melanjutkan perjalanan",
                "score": 25
            },
            {
                "text": "Tanyakan arah pada jamur",
                "score": 50
            },
            {
                "text": "Beri salam kepada jamur",
                "score": 75
            },
            {
                "text": "Perkenalkan diri Anda dan tanyakan arah pada jamur",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro tidak terlalu memperhatikan jamur dan memutuskan untuk melanjutkan perjalanan*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ifuly memperhatikan bahwa seseorang tampaknya mendekatinya, dan dia berlari ke dalam rumahnya."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Beri salam kepada jamur*",
                        "Hi..."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohh, emm.. hai...",
                        "*Ifuly terlihat sangat malu dan masuk ke dalam rumahnya.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Menanyakan arah.*",
                        "Permisi, apakah saya berada di arah yang benar ke Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "... Oh hai, maaf. Bisakah Anda mengulangi pertanyaan Anda? Saya tidak sepenuhnya memperhatikan."
                    ]
                },
                {
                    "position": -1,
                    "name": "id tba: Pomoro/You",
                    "text": [
                        "Tentu, jadi saya ingin pergi ke Prospevil, apakah saya berada di jalur yang benar?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohhh, Prospevil. Saya pikir itu benar, tetapi saya tidak yakin.",
                        "Mungkin Anda bisa mengecek dengan salah satu saudara perempuan saya, mereka pergi beberapa jam yang lalu."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Memperkenalkan diri dan menanyakan arah*",
                        "Halo, nama saya Pomoro. Apakah saya berada di arah yang benar ke Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Oh, hi Pomoro.",
                        "Maaf, saya tidak memperhatikan sepenuhnya. Ngomong-ngomong, di Italia. Apakah Anda keberatan mengulangi pertanyaan Anda?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, jadi saya ingin pergi ke Prospevil, apakah saya sudah berada di jalur yang benar?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohhh, Prospevil. Saya pikir itu benar, tetapi Anda dapat memeriksa kembali dengan saudara perempuan saya jika Anda bertemu dengan mereka",
                        "Mereka sudah sering ke sana, saya hanya ke sana beberapa kali"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, bolehkah saya tahu siapa nama saudara perempuan Anda?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Mereka terlihat mirip dengan saya dan nama mereka adalah Bolebole, Agari & Imuc.",
                        "Juga sapa saya jika Anda bertemu mereka, Pomoro!"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 2,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_00_01_02",
        "background": "bg-sc_02",
        "intro_en":
        [
            "Upon venturing deep into the Vefurata forest, Pomoro discovers a carrot house on the cliff. He seems curious and went inside the carrot house.",
            "Once Pomoro arrived there, he saw a carrot humanoid."
        ],
        "intro_id":
        [
            "Saat menjelajah jauh ke dalam hutan Vefurata, Pomoro menemukan rumah wortel di tebing. Dia tampak penasaran dan masuk ke dalam rumah wortel.",
            "Begitu Pomoro tiba di sana, dia melihat humanoid wortel."
        ],
        "emotions_en":
        [
            {
                "text": "Bliss",
                "score": 25,
                "info": "Reaching a state of pure and profound happiness. This level of happiness transcends daily experiences and is often associated with  or transcendent moments of ecstasy and serenity."
            },
            {
                "text": "Fulfillment",
                "score": 50,
                "info": "Achieving a deep sense of purpose and meaning in life. This level of happiness is attained when one's values, and aspirations align with their actions and accomplishments."
            },
            {
                "text": "Contentment",
                "score": 75,
                "info": "State of inner peace and satisfaction that arises from embracing one's current circumstances without longing for more. It involves finding joy and fulfillment in the present moment, appreciating what one has, and letting go of the constant pursuit of external desires. Contentment allows individuals to experience a deep sense of tranquility and well-being, accepting life as it is and finding happiness within themselves."
            },
            {
                "text": "Excitement",
                "score": 100,
                "info": "State of heightened anticipation and enthusiasm that arises from the prospect of something new, thrilling, or engaging. It is characterized by a surge of energy and a sense of eager anticipation, often accompanied by feelings of joy or exhilaration. Excitement can be sparked by various experiences, such as upcoming events, adventures, achievements, or even the unknown, and it invigorates individuals by igniting a sense of curiosity, passion, and positive anticipation."
            }

        ],
        "emotions_id":
        [
            {
                "text": "Kebahagiaan",
                "score": 25,
                "info": "Mencapai keadaan kebahagiaan yang murni dan mendalam. Tingkat kebahagiaan ini melampaui pengalaman sehari-hari dan sering dikaitkan dengan atau momen transenden ekstasi dan ketenangan."
            },
            {
                "text": "Pemenuhan",
                "score": 50,
                "info": "Mencapai tujuan dan makna hidup yang mendalam. Tingkat kebahagiaan ini dicapai ketika nilai dan aspirasi seseorang selaras dengan tindakan dan pencapaian mereka."
            },
            {
                "text": "Kepuasan",
                "score": 75,
                "info": "Keadaan kedamaian dan kepuasan batin yang muncul dari merangkul keadaan saat ini tanpa merindukan lebih. Ini melibatkan menemukan kegembiraan dan kepuasan pada saat ini, menghargai apa yang dimiliki seseorang, dan melepaskan pengejaran terus-menerus dari keinginan eksternal. Kepuasan memungkinkan individu untuk mengalami rasa ketenangan dan kesejahteraan yang mendalam, menerima kehidupan apa adanya dan menemukan kebahagiaan dalam diri mereka sendiri."
            },
            {
                "text": "Kegembiraan",
                "score": 100,
                "info": "Keadaan antisipasi dan antusiasme tinggi yang muncul dari prospek akan sesuatu yang baru, mendebarkan, atau menarik. Ini ditandai dengan gelombang energi dan rasa antisipasi yang bersemangat, sering kali disertai dengan perasaan senang atau gembira. Kegembiraan dapat dipicu oleh berbagai pengalaman, seperti peristiwa yang akan datang, petualangan, pencapaian, atau bahkan hal yang tidak diketahui, dan itu menyegarkan individu dengan memicu rasa ingin tahu, semangat, dan antisipasi positif."
            }    
        ],


        "response_en":
        [
            {
                "text": "Feel a bit awkward to ask, decide to continue the journey",
                "score": 50
            },
            {
                "text": "Decide to approach and greet the carrot to ask him for inputs",
                "score": 75
            },
            {
                "text": "Feel quite intrigued, feels a desire to start a convo",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Feels a bit awkward or shy to ask and decides to continue on the journey.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "*Ota look sembarrassed and goes inside her house.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Feels quite intrigued seeing the carrot and has a desire to start a conversation*",
                        "Such a good day isn't it."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Yes! It's such a good day and I'm glad.",
                        "Alright, time to get to work.",
                        "*Ota swings his shovel, puts it on his right shoulder, and starts to leave his yard.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Decide to approach and greet the carrot to ask him for his inputs.*",
                        "Hello, it’s such a good day isn't it."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Surely.. a day like this lifts up ones spirits. Where are you heading?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "I'm heading to Prospevil, have you been there before?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Ohh, Prospevil! Truly a very beautiful place that you are heading to.",
                        "We all lived near that area back then."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Wait, 'we all'? What do you mean?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Yeap. Pasti, Naca, Daucu and I. Oh and I forgot to tell you, my name is Ota."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ahh, seems so nice having a tight-knit family. My name is Pomoro! It’s a pleasure to meet you, Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Yes, pleasure to meet you too, Pomoro. Have a great day! I'm going to go to work!",
                        "*Ota swings his shovel, puts it on his right shoulder, and starts to leave his yard with a bright smile on his face.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro leaves with joy and with a smile on his face.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Merasa agak canggung untuk bertanya, memutuskan untuk melanjutkan perjalanan",
                "score": 50
            },
            {
                "text": "Putuskan untuk mendekati dan menyapa wortel untuk meminta masukan darinya",
                "score": 75
            },
            {
                "text": "Merasa cukup penasaran, merasakan keinginan untuk memulai obrolan",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Merasa sedikit canggung atau malu untuk bertanya dan memutuskan untuk melanjutkan perjalanan.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "*Ota terlihat malu dan masuk ke dalam rumahnya.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Merasa cukup tertarik melihat wortel dan memiliki keinginan untuk memulai percakapan*",
                        "Hari yang begitu baik bukan."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Ya! Ini hari yang baik dan saya senang.",
                        "Baiklah, saatnya bekerja.",
                        "*Ota mengayunkan sekopnya, meletakkannya di bahu kanannya, dan mulai meninggalkan pekarangannya.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Putuskan untuk mendekati dan menyapa wortel untuk meminta masukannya.*",
                        "Halo, ini hari yang baik bukan."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Tentunya .. hari seperti ini mengangkat semangat seseorang. Kemana tujuanmu?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Saya menuju ke Prospevil, apakah Anda pernah ke sana sebelumnya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Ohh, Prospervil! Benar-benar tempat yang sangat indah yang Anda tuju.",
                        "Kami semua tinggal di dekat daerah itu saat itu."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tunggu, 'kita semua'? Apa maksudmu?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Ya. Pasti, Naca, Daucu dan aku. Oh dan aku lupa memberitahumu, namaku Ota."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ahh, sepertinya menyenangkan memiliki keluarga yang erat. Nama saya Pomoro! Senang bertemu denganmu, Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Ya, senang bertemu denganmu juga, Pomoro. Semoga harimu menyenangkan! Aku akan pergi bekerja!",
                        "*Ota mengayunkan sekopnya, meletakkannya di bahu kanannya, dan mulai meninggalkan pekarangannya dengan senyum cerah di wajahnya.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro pergi dengan gembira dan dengan senyum di wajahnya.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 3,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_03_04_05",
        "background": "bg-sc_03",
        "intro_en":
        [
            "Once he was back on his feet, he resumed his quest and reached the incline, filled with humid air.",
            "Pomoro saw some movement among the trees, and dared himself to investigate what that motion is.",
            "To his surprise, Pomoro saw a familiar sight. He saw three young mushrooms.",
            "It reminded him of Ifuly."
        ],
        "intro_id":
        [
            "Begitu dia kembali berdiri, dia melanjutkan pencariannya dan mencapai tanjakan, dipenuhi udara lembab.",
            "Pomoro melihat beberapa gerakan di antara pepohonan, dan memberanikan diri untuk menyelidiki gerakan apa itu.",
            "Yang mengejutkan, Pomoro melihat pemandangan yang familiar. Dia melihat tiga jamur muda.",
            "Itu mengingatkannya pada Ifuly."
        ],
        "emotions_en":
        [
            {
                "text": "Imaginative playfulness",
                "score": 25,
                "info": "Embracing creativity and imagination during play. This level of playfulness involves the exploration of imaginary worlds, storytelling, role-playing, or engaging with toys, props, or artistic activities. It encourages imaginative thinking, problem-solving, and the expression of one's inner world."
            },
            {
                "text": "Adventurous playfulness",
                "score": 50,
                "info": "Embracing a sense of adventure, exploration, and risk-taking play. This level of playfulness involves seeking new experiences, pushing boundaries, and engaging in challenging or thrilling activities. It often involves a spirit of curiosity, daring, and a willingness to  outside of one's comfort zone."
            },
            {
                "text": "Light hearted playfulness",
                "score": 75,
                "info": "A carefree and joyful state of being, characterized by a lighthearted attitude and a playful approach to life. It involves engaging in activities or interactions with a sense of spontaneity, humor, and a lack of seriousness. It often brings a sense of levity, laughter, and a refreshing break from the pressures and responsibilities of everyday life, allowing individuals to embrace their inner child and find happiness in the simple joys of the present moment."
            },
            {
                "text": "Energetic playfulness",
                "score": 100,
                "info": "Exhibiting a higher level of energy and enthusiasm during play. This level of playfulness involves more active and dynamic participation, such as engaging in physical activities, games, or playful competitions. It often involves a sense of excitement, movement, and vitality."
            }

        ],
        "emotions_id":
        [
            {
                "text": "Kegembiraan imajinatif",
                "score": 25,
                "info": "Merangkul kreativitas dan imajinasi selama bermain. Tingkat keceriaan ini melibatkan eksplorasi dunia imajiner, mendongeng, bermain peran, atau terlibat dengan mainan, properti, atau aktivitas artistik. Ini mendorong pemikiran imajinatif, pemecahan masalah, dan ekspresi dunia batin seseorang."
            },
            {
                "text": "Kegembiraan petualang",
                "score": 50,
                "info": "Merangkul rasa petualangan, eksplorasi, dan permainan pengambilan risiko. Tingkat keceriaan ini melibatkan pencarian pengalaman baru, mendorong batasan, dan terlibat dalam aktivitas yang menantang atau mendebarkan. Ini sering melibatkan semangat keingintahuan, keberanian, dan kemauan untuk keluar dari zona nyaman seseorang."
            },
            {
                "text": "Keceriaan ringan",
                "score": 75,
                "info": "Keadaan riang dan gembira, ditandai dengan sikap ringan dan pendekatan hidup yang menyenangkan. Ini melibatkan terlibat dalam kegiatan atau interaksi dengan rasa spontanitas, humor, dan kurangnya keseriusan. Itu sering membawa rasa kesembronoan, tawa, dan istirahat yang menyegarkan dari tekanan dan tanggung jawab kehidupan sehari-hari, memungkinkan individu untuk merangkul anak batin mereka dan menemukan kebahagiaan dalam kegembiraan sederhana saat ini."
            },
            {
                "text": "Kegembiraan yang energik",
                "score": 100,
                "info": "Menunjukkan tingkat energi dan antusiasme yang lebih tinggi selama bermain. Tingkat keceriaan ini melibatkan partisipasi yang lebih aktif dan dinamis, seperti terlibat dalam aktivitas fisik, permainan, atau kompetisi yang menyenangkan. Ini sering melibatkan rasa kegembiraan, gerakan, dan vitalitas."
            }  
        ],


        "response_en":
        [
            {
                "text": "Quickly go up to the three of them to ask them questions",
                "score": 50
            },
            {
                "text": "Wants to approach them modestly, wondering if they are Ifuly's sisters",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Quickly go up to the three of them to ask them if they are related to Ifuly.*",
                        "Hey, you guys look familiar!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Whattt?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "We all siblingsss"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "We are more than triplets!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole, Agari, Imuc",
                    "text": [
                        "*Together they gather and shout*",
                        "// Sister said we shouldn't talk to impolite people! //",
                        "*They go to other trees a few meters from there and start to play together again....*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro is shocked and they leave immediately.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Wants to approach them modestly, wondering if they are Ifuly’s younger sisters.*",
                        "Excuse me, may I know if the three of you are Ifuly’s sisters?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Wooo..?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "You met our big sister?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "How is she doing?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Well, she seems fine but a little bit shy. Anyway, she said hi to all of you. I think she is worried."
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Wait wait! Sister worry about us?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Ohh no! I want to play around first!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Don't worry, we’ll be heading back later. Thanksfor letting us know!",
                        "Yes indeed she is a little bit shy, but she cares a lot about us"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So I have a question for all of you",
                        "Big sis says that you guys know the direction to Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Ayy, a Prospevil!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Prospevil... Just go straight ahead!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Yesss. Just go straight that is the rightdirection",
                        "We will head back to big sis later. Thank you!"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Cepat pergi ke mereka bertiga untuk mengajukan pertanyaan kepada mereka",
                "score": 50
            },
            {
                "text": "Ingin mendekati mereka dengan sopan, bertanya-tanya apakah mereka adalah saudara perempuan Ifuly",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Cepat pergi ke mereka bertiga untuk menanyakan apakah mereka berhubungan dengan Ifuly.*",
                        "Hei, kalian terlihat akrab!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Apaaa?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Kita semua bersaudaraaa"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Kami lebih dari kembar tiga!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole, Agari, Imuc",
                    "text": [
                        "*Bersama-sama mereka berkumpul dan berteriak*",
                        "// Kakak bilang kita tidak boleh berbicara dengan orang yang tidak sopan! //",
                        "*Mereka pergi ke pohon lain beberapa meter dari sana dan mulai bermain bersama lagi....*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro kaget dan mereka langsung pergi.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Ingin mendekati mereka dengan sopan, bertanya-tanya apakah mereka adalah adik perempuan Ifuly.*",
                        "Permisi, bolehkah saya tahu jika kalian bertiga adalah saudara perempuan Ifuly?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Wooo..?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Anda bertemu kakak perempuan kami?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Bagaimana kabarnya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yah, dia tampak baik-baik saja tetapi sedikit pemalu. Bagaimanapun, dia menyapa kalian semua. Saya pikir dia khawatir."
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Tunggu tunggu! Kakak mengkhawatirkan kami?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Oh tidak! Aku ingin bermain-main dulu!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Jangan khawatir, kami akan kembali lagi nanti. Terima kasih telah memberi tahu kami!",
                        "Ya memang dia sedikit pemalu, tapi dia sangat peduli dengan kami"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Jadi saya punya pertanyaan untuk kalian semua",
                        "Kakak bilang kalian tahu arah ke Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Ayy, Prospevil!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Prospevil... Langsung saja!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Ya. Jalan lurus saja itu arah yang benar",
                        "Kami akan kembali ke kakak nanti. Terima kasih!"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 4,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_03_04_05",
        "background": "bg-sc_04",
        "intro_en":
        [
            "Pomoro sets off on his journey again. He managed to go through the forest, passing through various obstacles.",
            "When Pomoro nearly reached the edge of the forest, he heard something. He heard a rumble, but it’s not the sound of a beast, nor thunder.",
            "Pomoro seems unsure but is curious to investigate the source of the sound.",
            "The sound is starting to get closer and closer, and to his surprise, Pomoro saw a Turnip Warrior."
        ],
        "intro_id":
        [
            "Pomoro memulai perjalanannya lagi. Dia berhasil melewati hutan, melewati berbagai rintangan.",
            "Ketika Pomoro hampir mencapai tepi hutan, dia mendengar sesuatu. Dia mendengar gemuruh, tapi itu bukan suara binatang buas, bukan pula guntur.",
            "Pomoro sepertinya tidak yakin tapi penasaran untuk menyelidiki sumber suara itu.",
            "Suara itu mulai semakin dekat, dan yang mengejutkan, Pomoro melihat seorang Prajurit Lobak."
        ],
        "emotions_en":
        [
            {
                "text": "Rage",
                "score": 25,
                "info": "Encountering an intense and uncontrollable anger that can lead to a loss of self-control. This level of anger is characterized by an explosive emotional outburst, accompanied by a heightened physical and psychological arousal. Rage can result in aggressive or destructive behavior."
            },
            {
                "text": "Irritation",
                "score": 50,
                "info": "Feeling a mild annoyance or frustration in response to a minor inconvenience or disruption. This level of anger is relatively low intensity and may arise from everyday irritants or inconveniences."
            },
            {
                "text": "Hostility",
                "score": 75,
                "info": "Exhibiting a strong antagonistic attitude or aggressive behavior towards someone or something. This level of animosity entails a more overt and confrontational stance, with a significant intent to harm, obstruct, or undermine the target."
            },
            {
                "text": "Anger",
                "score": 100,
                "info": "Experiencing a more pronounced emotional state of displeasure, often triggered by perceived injustices, conflicts, or violations of personal boundaries. This level of anger involves a stronger emotional response, including feelings of resentment, indignation, or frustration."
            }

        ],
        "emotions_id":
        [
            {
                "text": "Kemarahan",
                "score": 25,
                "info": "Menghadapi kemarahan yang intens dan tak terkendali yang dapat menyebabkan hilangnya kendali diri. Tingkat kemarahan ini ditandai dengan ledakan emosi yang meledak-ledak, disertai dengan peningkatan gairah fisik dan psikologis. Kemarahan dapat mengakibatkan perilaku agresif atau destruktif."
            },
            {
                "text": "Kejengkelan",
                "score": 50,
                "info": "Merasakan gangguan atau frustrasi ringan sebagai tanggapan atas ketidaknyamanan atau gangguan kecil. Tingkat kemarahan ini relatif rendah intensitasnya dan dapat timbul dari iritasi atau ketidaknyamanan sehari-hari."
            },
            {
                "text": "Permusuhan",
                "score": 75,
                "info": "Menunjukkan sikap antagonis yang kuat atau perilaku agresif terhadap seseorang atau sesuatu. Tingkat permusuhan ini memerlukan sikap yang lebih terbuka dan konfrontatif, dengan maksud yang signifikan untuk menyakiti, menghalangi, atau merusak target."
            },
            {
                "text": "Kemarahan",
                "score": 100,
                "info": "Mengalami ketidaksenangan emosional yang lebih jelas, sering kali dipicu oleh anggapan ketidakadilan, konflik, atau pelanggaran batas-batas pribadi. Tingkat kemarahan ini melibatkan respons emosional yang lebih kuat, termasuk perasaan dendam, marah, atau frustrasi."
            } 
        ],


        "response_en":
        [
            {
                "text": "Not sure whether to be afraid or not, maybe it's not the best idea to approach",
                "score": 50
            },
            {
                "text": "Feel surprised seeing him on the high incline, decides to approach",
                "score": 75
            },
            {
                "text": "Feel concerned and want to offer him help",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Not sure whether to be afraid or not, partly thinking that it may not be the best idea to approach*",
                        "*Pomoro leaves immediately*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        ""
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Feel surprised seeing him on the high incline, decides to approach the turnip warrior.*",
                        "Wow, what are you doing in these lands? You seem troubled?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Rapa's madd. Angry! I was looking for Mupa, Mupo and Mupi."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, Mu Ma Mo.. what?!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Hahh! There’s no time to explain. They look like me",
                        "If you meet them, tell them to go here"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Wait up! I need to go to Prospevil."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Yes, good! So you can continue heading west, that is the direction to Prospevil.",
                        "And I’m heading to the East.",
                        "*Rapa rush to the East*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro startled & bweildered*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Sees the turnip on a high incline, feel concerned and want to offer him help*",
                        "You seem troubled. May I help?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Argghh.. Mupa, Mupo and Mupi where are they!?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa, Mupo and Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Herrghh, all of my brothers, I can't find 'em",
                        "I'm lookin for 'em, but where are they now?",
                        "Aghh, If you happen to come across them, I'll be glad if you can tell them to go back here"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Wait up! I have to go to Prospevil.",
                        "But I’ll tell them if I meet them along my journey."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Oh, so you want to go to Prospevil.",
                        "You can go to the West.",
                        "And I can go to the East.",
                        "Tell 'em I'm lookin for 'em if you meet 'em."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Sure thing, I'll let them know....",
                        "*Rapa and Pomoro go on separate directions.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Tidak yakin apakah harus takut atau tidak, mungkin itu bukan ide terbaik untuk didekati",
                "score": 50
            },
            {
                "text": "Merasa terkejut melihatnya di tanjakan tinggi, memutuskan untuk mendekat",
                "score": 75
            },
            {
                "text": "Merasa prihatin dan ingin menawarkan bantuan kepadanya",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Tidak yakin apakah harus takut atau tidak, sebagian berpikir bahwa itu mungkin bukan ide terbaik untuk didekati*",
                        "*Pomoro pergi dengan segera*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        ""
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Merasa terkejut melihatnya di tanjakan tinggi, memutuskan untuk mendekati pendekar lobak.*",
                        "Wow, apa yang kamu lakukan di sini? Anda tampak bermasalah?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Gila Kesal. Marah! Saya mencari Mupa, Mupo dan Mupi."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, Mu Ma Mo.. haa?!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Hah! Tidak ada waktu untuk menjelaskan. Mereka terlihat seperti saya",
                        "Jika Anda bertemu mereka, suruh mereka pergi ke sini"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tunggu! Saya harus pergi ke Prospevil."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Ya baik! Jadi Anda bisa melanjutkan ke barat, yaitu arah ke Prospevil.",
                        "Dan saya menuju ke Timur.",
                        "*Rapa buru-buru ke Timur*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "* Pomodoro kaget dan bingung"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Melihat lobak di tanjakan yang tinggi, merasa prihatin dan ingin menawarkan bantuan*",
                        "Anda tampak bermasalah. Bisakah saya bantu?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Argghh.. Mupa, Mupo dan Mupi dimana mereka!?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa, Mupo and Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Herrghh, semua saudaraku, aku tidak bisa menemukan mereka",
                        "Aku mencari mereka, tapi dimana mereka sekarang?",
                        "Aghh, Jika Anda kebetulan menemukan mereka, saya akan senang jika Anda dapat memberitahu mereka untuk kembali ke sini"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tunggu! Aku harus pergi ke Prospevil.",
                        "Tapi saya akan memberi tahu mereka jika saya bertemu mereka di sepanjang perjalanan saya."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Oh, jadi kamu ingin pergi ke Prospevil.",
                        "Anda bisa pergi ke Barat.",
                        "Dan saya bisa pergi ke Timur.",
                        "Katakan pada mereka, aku mencari mereka jika kamu bertemu mereka."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tentu saja, saya akan memberi tahu mereka ....",
                        "*Rapa dan Pomoro pergi ke arah yang berbeda.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 5,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_03_04_05",
        "background": "bg-sc_05",
        "intro_en":
        [
            "Once he was back on his feet, he resumed his quest and headed out to the forest.",
            "He passed a wide, green grass field with a pathway, and saw a couple of carrot humanoids resting under the tree beside the pathway."
        ],
        "intro_id":
        [
            "Begitu dia kembali berdiri, dia melanjutkan pencariannya dan menuju ke hutan.",
            "Dia melewati padang rumput hijau yang luas dengan jalan setapak, dan melihat beberapa humanoid wortel sedang beristirahat di bawah pohon di samping jalan setapak."
        ],
        "emotions_en":
        [
            {
                "text": "Fulfillment",
                "score": 25,
                "info": "Achieving a deep sense of purpose and meaning in life. This level of happiness is attained when one's values, and aspirations align with their actions and accomplishments."
            },
            {
                "text": "Unstoppable Passion",
                "score": 50,
                "info": "Refers to an intense and unwavering drive or enthusiasm towards a particular pursuit or goal. It is characterized by a relentless determination, a burning desire, and a steadfast commitment to overcoming obstacles and achieving success. Unstoppable passion empowers individuals to persevere through challenges, fueling their actions with unwavering dedication and a refusal to be deterred, ultimately leading to the fulfillment of their ambitions."
            },
            {
                "text": "Moderate Drive",
                "score": 75,
                "info": "Experiencing a noticeable increase in motivation and determination. This level of incentive involves a stronger sense of purpose and focus, often fueled by external rewards, recognition, or a clear sense of progress towards a desired outcome."
            },
            {
                "text": "Excitement",
                "score": 100,
                "info": "Experiencing a heightened state of joy and enthusiasm. This level of happiness is characterized by a sense of anticipation, thrill, or delight."
            }

        ],
        "emotions_id":
        [
            {
                "text": "Pemenuhan",
                "score": 25,
                "info": "Mencapai tujuan dan makna hidup yang mendalam. Tingkat kebahagiaan ini dicapai ketika nilai dan aspirasi seseorang selaras dengan tindakan dan pencapaian mereka."
            },
            {
                "text": "Gairah yang Tak Terbendung",
                "score": 50,
                "info": "Mengacu pada dorongan atau antusiasme yang kuat dan tak tergoyahkan terhadap pengejaran atau tujuan tertentu. Ini ditandai dengan tekad yang tak kenal lelah, hasrat yang membara, dan komitmen yang teguh untuk mengatasi rintangan dan mencapai kesuksesan. Gairah yang tak terbendung memberdayakan individu untuk bertahan melalui tantangan, memicu tindakan mereka dengan dedikasi yang tak tergoyahkan dan penolakan untuk terhalang, yang pada akhirnya mengarah pada pemenuhan ambisi mereka."
            },
            {
                "text": "Kegembiraan Sedang",
                "score": 75,
                "info": "Mengalami peningkatan motivasi dan tekad yang nyata. Tingkat insentif ini melibatkan rasa tujuan dan fokus yang lebih kuat, sering didorong oleh penghargaan eksternal, pengakuan, atau rasa kemajuan yang jelas menuju hasil yang diinginkan."
            },
            {
                "text": "Kegembiraan",
                "score": 100,
                "info": "Mengalami keadaan kegembiraan dan antusiasme yang tinggi. Tingkat kebahagiaan ini ditandai dengan rasa antisipasi, sensasi, atau kegembiraan."
            }
        ],


        "response_en":
        [
            {
                "text": "Take notice at these two carrot humanoids, they seem related to Ota",
                "score": 50
            },
            {
                "text": "They seem familiar. Try and figure out who they are",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*They seem familiar. Try and figure out who these two are*",
                        "Woah, do I know you two?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Why why why? It's a good day for excitement, how do you know us?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Maybe maybe maybe. But how, when? Exciting isn’t it, yes yes yes?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yeah, wait hmm… I forgot his name.",
                        "Erm...uu something? Oo.. Oott?",
                        "Ota???"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owh owh owh, Ota Ota Ota?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Big big big brother Ota, ya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yes, I think. He went to work with a bright smile on his face!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Surely surely surely, brother Ota always vibing with his smile every single day!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "No matter how hard the day is, big brother Ota always always always find reasons to smile."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yes, such a jolly  personality!",
                        "Okay then, gotta go. Have a great day."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "// Thank you thank you thank you. Have a pleasant day too! //"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Notice these two carrot humanoids, they seem to be related with Ota*",
                        "Hey! You two look just like Ota!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owww, Ota Ota Ota? So you meet him somewhere, yes yes yes?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "How's big big big brother doing there?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yeah, he seems fine. Also Ota seemed so happy when he went to work!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Always smiling so generously, brother Ota always smile no matter what!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "There's not a bad bad bad day for brother Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "It seems nice to know someone like him.",
                        "I would love to meet him again someday."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Surely surely surely, you may."
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "It's true true true, you can."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay then, it’s a pleasure to meet the both of you.",
                        "Have a great day!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "// Yess yess yess. Have a great day too! //"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Perhatikan dua humanoid wortel ini, sepertinya mereka berhubungan dengan Ota",
                "score": 50
            },
            {
                "text": "Mereka tampak akrab. Coba dan cari tahu siapa mereka",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Mereka tampak akrab. Coba cari tahu siapa mereka berdua*",
                        "Woah, apa aku mengenal kalian berdua?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Kenapa kenapa kenapa? Ini hari yang bagus untuk bersenang-senang, bagaimana kamu mengenal kami?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Mungkin mungkin mungkin. Tapi bagaimana, kapan? Seru bukan, ya ya ya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, tunggu hmm… aku lupa namanya.",
                         "Erm...uu sesuatu? Oo.. Oott?",
                         "Ota???"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owh owh owh, Ota Ota Ota?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Kak kak kakak Ota, ya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, saya pikir. Dia pergi bekerja dengan senyum cerah di wajahnya!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Pasti pasti pasti, Kak Ota selalu bergetar dengan senyumnya setiap hari!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Seberat apapun hari ini, kakak Ota selalu selalu menemukan alasan untuk tersenyum."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, kepribadian yang periang!",
                        "Baiklah kalau begitu, aku harus pergi. Semoga harimu menyenangkan."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "// Terima kasih terima kasih terima kasih. Semoga harimu menyenangkan juga! //"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Perhatikan dua humanoid wortel ini, sepertinya mereka berhubungan dengan Ota*",
                        "Hei! Kalian berdua mirip Ota!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owww, Ota Ota Ota? Jadi ketemu dia di suatu tempat, ya ya ya?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Bagaimana kabar kak kak kakak di sana?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, dia terlihat baik-baik saja. Ota juga terlihat sangat senang ketika dia pergi bekerja!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Selalu tersenyum dengan murah hati, kakak Ota selalu tersenyum apapun yang terjadi!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Tidak ada hari buruk yang buruk untuk saudara Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Sepertinya senang mengenal seseorang seperti dia.",
                        "Aku ingin sekali bertemu dengannya lagi suatu hari nanti."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Pasti pasti pasti, kamu bisa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Itu benar benar benar, kamu bisa."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Baiklah kalau begitu, senang bertemu kalian berdua.",
                        "Semoga harimu menyenangkan!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "// Ya ya ya. Semoga harimu menyenangkan juga! //"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 6,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_06_07_08",
        "background": "bg-sc_06_07_08",
        "intro_en":
        [
            "As Pomoro  leaves the area, he saw boulders along a small incline a few hundred meters ahead.",
            "Close to the first group of boulders, Pomoro saw turnip children."
        ],
        "intro_id":
        [
            "Saat Pomoro meninggalkan daerah itu, dia melihat batu-batu besar di sepanjang tanjakan kecil beberapa ratus meter di depan.",
            "Di dekat kelompok batu pertama, Pomoro melihat anak-anak lobak."
        ],
        "emotions_en":
        [
            {
                "text": "Sorrow",
                "score": 25,
                "info": "Experiencing profound and long-lasting sadness that permeates various aspects of life. This level of sadness can be associated with prolonged grief, significant trauma, or  emotional pain. It may affect one's ability to function and require support to address and manage."
            },
            {
                "text": "Mild remorse",
                "score": 50,
                "info": "Feeling a slight sense of guilt or regret in response to a minor wrongdoing or a perceived violation of personal values. This level of guilt is relatively low intensity and may involve a sense of unease, self-reflection, or the recognition of a minor mistake."
            },
            {
                "text": "Disappointment",
                "score": 75,
                "info": "Feeling let down or dissatisfied due to unmet expectations or unfavorable outcomes. This level of sadness is typically milder and temporary, often related to specific events or circumstances."
            },
            {
                "text": "Moderate culpability",
                "score": 100,
                "info": "Experiencing a more pronounced level of guilt, often accompanied by a stronger sense of responsibility for a perceived wrongdoing. This level of guilt involves a deeper  response, such as feelings of remorse, shame, or self-blame, and may motivate efforts to make amends or seek forgiveness."
            }

        ],
        "emotions_id":
        [
            {
                "text": "Duka",
                "score": 25,
                "info": "Mengalami kesedihan yang mendalam dan bertahan lama yang menembus berbagai aspek kehidupan. Tingkat kesedihan ini dapat dikaitkan dengan kesedihan yang berkepanjangan, trauma yang signifikan, atau rasa sakit emosional. Ini dapat memengaruhi kemampuan seseorang untuk berfungsi dan membutuhkan dukungan untuk mengatasi dan mengelolanya."
            },
            {
                "text": "Penyesalan ringan",
                "score": 50,
                "info": "Merasakan sedikit rasa bersalah atau penyesalan sebagai tanggapan atas kesalahan kecil atau pelanggaran nilai-nilai pribadi yang dirasakan. Tingkat rasa bersalah ini relatif rendah dan mungkin melibatkan rasa tidak nyaman, refleksi diri, atau pengakuan kesalahan kecil ."
            },
            {
                "text": "Kekecewaan",
                "score": 75,
                "info": "Merasa kecewa atau tidak puas karena harapan yang tidak terpenuhi atau hasil yang tidak diinginkan. Tingkat kesedihan ini biasanya lebih ringan dan sementara, seringkali terkait dengan kejadian atau keadaan tertentu."
            },
            {
                "text": "Kesalahan sedang",
                "score": 100,
                "info": "Mengalami tingkat rasa bersalah yang lebih jelas, seringkali disertai dengan rasa tanggung jawab yang lebih kuat atas kesalahan yang dirasakan. Tingkat rasa bersalah ini melibatkan respons yang lebih dalam, seperti perasaan menyesal, malu, atau menyalahkan diri sendiri, dan dapat memotivasi upaya untuk membuat memperbaiki atau meminta pengampunan."
            }
        ],


        "response_en":
        [
            {
                "text": "Call the three of them from afar",
                "score": 50
            },
            {
                "text": "Come to them to inquire further",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Call on the three of them from afar*",
                        "Wait, are they the ones who Rapa is looking for?",
                        "Hey, are you Mupa, Mupo, or Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Ohh no no no! I shouldn't have told them to go up there, haaa..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Hey, what's going on?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Mupa is very very sorry"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Where is Mupi & Mupo?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "They are up there on the boulder."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay, you go head back to Rapa. I'll check those two."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "I'm so sorry, thank you"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro steps up to another boulder while approaching Mupo & Mupi.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Come up to them to inquire further*",
                        "Hello, I'm Pomoro. Do you know Rapa? I thought you know Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Hah. I shouldn't have done that. Oh hi, I'm Mupa."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "What happened?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "I shouldn't have told 'em to chase the higher ground. And now they are up there on the boulder."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So, they are Mupo & Mupi, on the top of the another boulder?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Yeah,. we shouldn't have played that far actually."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay okay, relax. I'll head over to those two. You can go head back to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "So sorry. Thank you Pomoro."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro steps up to another boulder while approaching Mupi and Mupo.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Panggil mereka bertiga dari jauh",
                "score": 50
            },
            {
                "text": "Datanglah ke mereka untuk bertanya lebih lanjut",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Panggil mereka bertiga dari jauh*",
                        "Tunggu, apakah mereka yang dicari Rapa?",
                        "Hei, apakah kamu Mupa, Mupo, atau Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Oh tidak, tidak, tidak! Seharusnya aku tidak menyuruh mereka naik ke sana, haaa..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Hey apa yang terjadi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Mupa sangat sangat menyesal"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Di mana Mupi & Mupo?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Mereka ada di sana di atas batu besar."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Oke, kamu kembali ke Rapa. Aku akan memeriksa keduanya."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Maafkan aku, terima kasih"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro melangkah ke batu lain sambil mendekati Mupo & Mupi.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Datanglah ke mereka untuk bertanya lebih lanjut*",
                        "Halo, saya Pomoro. Apakah Anda mengenal Rapa? Saya pikir Anda mengenal Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Hah. Seharusnya aku tidak melakukan itu. Oh hai, aku Mupa."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Apa yang telah terjadi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Seharusnya aku tidak menyuruh mereka mengejar tempat yang lebih tinggi. Dan sekarang mereka ada di atas batu."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Jadi, mereka Mupo & Mupi, di atas batu yang lain?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Ya, kita seharusnya tidak bermain sejauh itu sebenarnya."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Oke oke, santai. Aku akan pergi ke mereka berdua. Kamu bisa kembali ke Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Maaf. Terima kasih Pomoro."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro melangkah ke batu lain sambil mendekati Mupi dan Mupo.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 7,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_06_07_08",
        "background": "bg-sc_06_07_08",
        "intro_en":
        [
            "Pomoro hikes up boulder by boulder to reach Mupi and finally stands on the same boulder as Mupi."
        ],
        "intro_id":
        [
            "sc-07 intro id tba 1"
        ],
        "emotions_en":
        [
            {
                "text": "Paralyzing remorse",
                "score": 25
            },
            {
                "text": "Terror",
                "score": 50
            },
            {
                "text": "Anxiety",
                "score": 75
            },
            {
                "text": "Panic",
                "score": 100
            }

        ],
        "emotions_id":
        [
            {
                "text": "emotion id 1",
                "score": 25
            },
            {
                "text": "emotion id 2",
                "score": 50
            },
            {
                "text": "emotion id 3",
                "score": 75
            },
            {
                "text": "emotion id 4",
                "score": 100
            }    
        ],


        "response_en":
        [
            {
                "text": "Approach him and tell him to come down from the pretty high boulder",
                "score": 50
            },
            {
                "text": "Gently approach him and persuade him to be careful and come down",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Approach him and tell him to get down from the high boulder*",
                        "Hey! Get down, it's dangerous up there!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Huaaa, Mupo won’t get down. Mupo can't go down, Mupi too scared!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay okay. you don't have to look down, Mupo.. Wait, are you Mupi or Mupo?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Ooo, okay. I'm Mupi. But Mupo is still up there."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So now we will go down from this boulder, okay? And go to Rapa after we landed."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Sss, sss.. suree..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Guided Mupi get down then go back to come over Mupo.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Gently approach him and persuade him to be careful and come down*",
                        "Hey, hey. Are you Mupo or Mupi. Mupa said we need to get down. Rapa is looking for you too."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Huaaa, Mupo wont get down. Mupi can't go down, too high, too scared.."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay okay. You don't have to look down, Mupi. So you are Mupi? Is that correct?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Ooo, ookayy.. Yes, I'm Mupi. But Mupo is still up there."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So now we will go down from this boulder, okay? And go to Rapa after we landed."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Sss, sss.. Suree..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Helps Mupi get down and then go back to help Mupo.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "response id A tba",
                "score": 75
            },
            {
                "text": "response id B tba",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Hey!! Get down, it's dangerous there."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "id tba: Huaaa, Mupo wont get downn. Mupi can't go down, too afraid."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Okay okay.. you don't have to look down, Mupo.. Wait, are you Mupi or Mupo?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "id tba: Ooo, ookayy.. I'm Mupi.. But Mupo still up there."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: So now we will go down from this boulder, okay? And go to Rapa after we landed."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "id tba: Sss, sss.. Suree..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: *Guided Mupi get down then go back to come over Mupo."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Hey, hey. Are you Mupo or Mupi. Mupa said we need to get down. Rapa looking for you too."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "id tba: Huaaa, Mupo wont get downn. Mupi can't go down, too high, too afraid."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Okay okay.. you don't have to look down.. So you're Mupi? Is that correct?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "id tba: Ooo, ookayy.. Yes, I'm Mupi.. But Mupo still up there."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: So now we will go down from this boulder, okay? And go to Rapa after we landed."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "id tba: Yy.. Yess, sss.. Suree..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: *Guided Mupi get down then go back to come over Mupo."
                    ]
                }
            ]
        ]
    },
    {
        "scene": 8,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_06_07_08",
        "background": "bg-sc_06_07_08",
        "intro_en":
        [
            "After Mupi managed to get down, Pomoro continued to climb the highest boulder, finally reaching Mupo.",
            "Mupo stood proudly with confidence where he looked so dignified on the sloppy boulder surface."
        ],
        "intro_id":
        [
            "sc-08 intro id tba 1"
        ],
        "emotions_en":
        [
            {
                "text": "Legacy",
                "score": 25
            },
            {
                "text": "Validation",
                "score": 50
            },
            {
                "text": "Accomplishment",
                "score": 75
            },
            {
                "text": "Recognition",
                "score": 100
            }

        ],
        "emotions_id":
        [
            {
                "text": "emotion id 1",
                "score": 25
            },
            {
                "text": "emotion id 2",
                "score": 50
            },
            {
                "text": "emotion id 3",
                "score": 75
            },
            {
                "text": "emotion id 4",
                "score": 100
            }    
        ],


        "response_en":
        [
            {
                "text": "Tell Mupi to be careful and warn him of the dangers",
                "score": 50
            },
            {
                "text": "Talk to Mupi and order him to come down",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Talk to Mupo and order him to come down*",
                        "Mupo, can you please get down, it's very dangerous here! You got to be really careful."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Mupo is on top of the world! No one can stop Mupooo!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupo, you are on a high and slippery boulder, can you please get down now?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "I’m on the highest peak!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa and Mupi are waiting for you to come to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Uhhh Rapa? Yess protecta family back and forth.",
                        "Okay, I'll go back to Rapa's place. Of I go to another high place, thanks!"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Tell Mupo to be careful and warn him of the dangers of standing on top of that boulder.*",
                        "Mupo, be careful there, it's dangerous. You're standing on a sloppy boulder."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Mupo is on top of the world, no one can stop Mupooo!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupo, could you please get down now?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "I’m on the highest peak!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa and Mupi waiting you come to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Uhhh Rapa? Yes, protect family back and forth.",
                        "Okay, I'll go back to Rapa's place. Of I go to another high place, thanks!"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "response id A tba",
                "score": 75
            },
            {
                "text": "response id B tba",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Mupo, would you get down, it's a bit dangerous here if we're not careful."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "id tba: Mupo is on top of the worldd, no one can stop Mupoo..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Mupo, you are on high place, would you please get down now?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "id tba: Imma on the highest peak, to protectt while seekk..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Mupa and Mupo waiting you come to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "id tba: Uhhh Rapa? Yess protectt and protecttt, protect family forth and back..",
                        "id tba: Okay, I'll go back to Rapa's place. Of mee goo to another highest placee, thanks!"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Mupo, careful there, it's dangerous. You're standing or sloppy boulder."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "id tba: Mupo is on top of the worldd, no one can stop Mupoo.. Bwahahahaha..!!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Mupo, you are on high place, would you please get down now?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "id tba: Imma on the highest peak, to protectt while seekk..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "id tba: Mupa and Mupi waiting you come to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "id tba: Uhhh Rapa? Yess protectt and protecttt, protect family forth and back..",
                        "id tba: Okay, I'll go back to Rapa's place. Of mee goo to another highest placee, thanks!"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 9,
        "has_quest": false,
        "audio": "bgm-emotion_understanding-sc_09",
        "background": "bg-sc_09",
        "intro_en":
        [
            "After some time, Pomoro continues on his way, and resumes his advantures.",
            "A few miles after leaving the boulders along the pathway, Pomoro saw a large village surrounded by rivers, green grass fields, and formidable walls.",
            "A few miles after leaving the boulders along the pathway, Pomoro saw a large village surrounded by rivers, green grass fields, and formidable walls.",
            "There after, Pomoro stands underneath the village gate. He realized that his journey gave him so many experiences and allowed him to encounter many different people in different unique situations.",
            "From then on, Pomoro continued to learn many things along his journey, driven by curiosity and courage."
        ],
        "intro_id":
        [
            "sc-09 intro id tba 1",
            "sc-09 intro id tba 2"
        ],
        "emotions_en": [],
        "emotions_id": [],
        "response_en": [],
        "response_id": [],
        "response_en_contexts": [],
        "response_id_contexts": []
    }
]