[
    {
        "scene" : -1,
        "has_quest" : false,
        "audio" : "bgm-emotion_understanding-sc_00_01_02",
        "background" : "background_main",
        "intro_en": [
            "You will start a role play in this visual novel style journey as the character 'Pomoro' in the fictional land of Prospevil.",
            "In each of your steps going forward, you will meet another character and will guess their emotion from first glance.",
            "After guessing their emotion from their facial expression and body language, the next step is to select the option that YOU would actually choose if you were in this story.",
            "Enjoy the game, good luck, and have fun!"
        ],
        "intro_id": [
            "Anda akan memulai permainan peran dalam perjalanan gaya novel visual ini sebagai karakter 'Pomoro' di negeri fiksi Prospevil.",
            "Dalam setiap langkahmu ke depan, kamu akan bertemu karakter lain dan akan menebak emosi mereka dari pandangan pertama.",
            "Setelah menebak emosi mereka dari ekspresi wajah dan bahasa tubuh mereka, langkah selanjutnya adalah memilih opsi yang benar-benar ANDA pilih jika Anda berada di cerita ini.",
            "Nikmati permainannya, semoga berhasil, dan bersenang-senanglah!"
        ],
        "emotions_en": [],
        "emotions_id": [],
        "response_en": [],
        "response_id": [],
        "response_en_contexts": [],
        "response_id_contexts": []
    },
    {
        "scene": 0,
        "has_quest": false,
        "audio": "bgm-emotion_understanding-sc_00_01_02",
        "background": "bg-sc_00",
        "intro_en":
        [
            "Once upon a time, in a far-off kingdom, there was a young adventurer named Pomoro who is known for his thirst for adventure. He started his journey to Prospevil, a prosperous village in the Kingdom of Vefurata.",
            "Pomoro set out on his journey, feeling excited to embark on this new adventure. To the forest of Vefurata."
        ],
        "intro_id":
        [
            "Pada suatu masa, di sebuah kerajaan yang jauh, hiduplah seorang petualang muda bernama Pomoro yang terkenal haus akan petualangan. Ia memulai perjalanannya menuju Prospevil, sebuah desa makmur di Kerajaan Vefurata.",
            "Pomoro memulai perjalanannya, merasa sangat bersemangat untuk memulai petualangan baru ini. Menuju hutan Vefurata."
        ],
        "emotions_en": [],
        "emotions_id": [],
        "response_en": [],
        "response_id": [],
        "response_en_contexts": [],
        "response_id_contexts": []
    },
    {
        "scene": 1,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_00_01_02",
        "background": "bg-sc_01",
        "intro_en":
        [
            "As he walked through the forest, Pomoro saw a mushroom humanoid in front of the house."
        ],
        "intro_id":
        [
            "Saat ia berjalan melalui hutan, Pomoro melihat seorang manusia jamur di depan sebuah rumah."
        ],
        "emotions_en":
        [
            {
                "text": "Unease",
                "score": 25,
                "info": "Feeling a mild sense of discomfort or concern in response to a perceived threat or potential danger. This level of fear is often fleeting and may arise from unfamiliar situations or minor worries.",
                "bullet_list": [
                    "Perceiving a threat or petential danger",
                    "Minor worry usually due unfamiliar situations"
                ]
            },
            {
                "text": "Pronounced Introversion",
                "score": 50,
                "info": "Encountering a significant inclination towards introversion, where social interactions can be challenging and draining. This level of shyness is characterized by a preference  solitude or small groups, a need for ample personal space, and a heightened sensitivity to external stimulation.",
                "bullet_list": [
                    "Social interactions challenging or draining",
                    "High need for personal space",
                    "Doesn't always like external simulation"
                ]
            },
            {
                "text": "Moderate Timidity",
                "score": 75,
                "info": "Experiencing a noticeable level of shyness that can impact interactions and self-expression. This level of shyness involves a greater tendency to avoid attention or seek solitude, and may involve feelings of self-doubt, nervousness, or difficulty initiating conversations or asserting oneself.",
                "bullet_list": [
                    "Shyness that can influence interactions",
                    "Wanna avoid attention or be alone",
                    "Find it hard to start conversations"
                ]
            },
            {
                "text": "Mild Self Consciousness",
                "score": 100,
                "info": "Feeling a slight discomfort or unease in social situations, particularly when meeting new people or being the center of attention. This level of shyness is relatively low intensity and may manifest as hesitation, blushing, or a preference for observing rather than actively participating.",
                "bullet_list": [
                    "Slight discomfort in social situations",
                    "Low intensity shiness",
                    "Prefer to observe people more than talk"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Gelisah",
                "score": 25,
                "info": "Merasakan rasa tidak nyaman atau kekhawatiran ringan sebagai respons terhadap ancaman yang dirasakan atau potensi bahaya. Tingkat ketakutan ini seringkali cepat berlalu dan mungkin timbul dari situasi yang tidak biasa atau kekhawatiran kecil.",
                "bullet_list": [
                    "Merasakan ancaman atau potensi bahaya",
                    "Kekhawatiran kecil biasanya karena situasi yang tidak biasa"
                ]
            },
            {
                "text": "Sikap Introvert",
                "score": 50,
                "info": "Menghadapi kecenderungan yang signifikan terhadap introversi, di mana interaksi sosial dapat menjadi tantangan dan menguras tenaga. Tingkat rasa malu ini dicirikan oleh preferensi kesendirian atau kelompok kecil, kebutuhan akan ruang pribadi yang luas, dan kepekaan yang meningkat terhadap rangsangan eksternal.",
                "bullet_list": [
                    "Interaksi sosial terasa menantang atau menguras tenaga",
                    "Membutuhkan ketenangan dan waktu menyendiri",
                    "Tidak terlalu suka dengan stimulan eksternal"
                ]
            },
            {
                "text": "Kurang Percaya Diri",
                "score": 75,
                "info": "Mengalami tingkat rasa malu yang nyata yang dapat memengaruhi interaksi dan ekspresi diri. Tingkat rasa malu ini melibatkan kecenderungan yang lebih besar untuk menghindari perhatian atau mencari kesendirian, dan mungkin melibatkan perasaan ragu-ragu, gugup, atau kesulitan memulai percakapan atau menegaskan diri sendiri.",
                "bullet_list": [
                    "Rasa malu yang dapat mempengaruhi interaksi dengan orang lain",
                    "Lebih memilih untuk menghindari perhatian atau menyendiri",
                    "Sulit memulai percakapan"
                ]
            },
            {
                "text": "Agak Malu-Malu",
                "score": 100,
                "info": "Merasa sedikit tidak nyaman atau gelisah dalam situasi sosial, terutama saat bertemu orang baru atau menjadi pusat perhatian. Tingkat rasa malu ini relatif rendah intensitasnya dan dapat bermanifestasi sebagai keragu-raguan, muka memerah, atau preferensi untuk mengamati daripada berpartisipasi secara aktif.",
                "bullet_list": [
                    "Sedikit ketidaknyamanan dalam situasi sosial",
                    "Rasa malu dengan intensitas rendah",
                    "Lebih suka mengamati orang daripada berbicara"
                ]
            }    
        ],


        "response_en":
        [
            {
                "text": "Pomoro does not pay too much attention to the mushroom and decides to continue on the journey",
                "score": 25
            },
            {
                "text": "Greets the mushroom",
                "score": 50
            },
            {
                "text": "Ask for directions",
                "score": 75
            },
            {
                "text": "Introduce yourself and ask for directions",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro does not pay too much attention to the mushroom and decides to continue on the journey*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ifuly noticed that someone seems to be approaching her, and he ran inside her house."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Greets the mushroom*",
                        "Hi..."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohh, emm.. hi there...",
                        "*Ifuly look so embarrassed and goes inside her house.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Ask for directions*",
                        "Excuse me, am I on the right direction to Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "... Oh hi, sorry. Can you repeat your question? I wasn't fully paying attention."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Sure, so I want to go to Prospevil, am I on the right direction?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohhh, Prospevil. I think it's correct, but I'm not sure.",
                        "Maybe you can double check with one of my sisters, they went out a few hours ago."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Introduce yourself and ask for directions*",
                        "Hello there, my name is Pomoro. Am I on the right direction to Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Oh, hi Pomoro.",
                        "Sorry, I didn't pay full attention. I'm Ifuly by the way. Do you mind repeating your question?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yes, so I want to go to Prospevil, am I on the right direction?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ohhh, Prospevil. I think it's correct, but you can double check with my sisters if you meet them",
                        "They've been there a lot, I've only been there few times"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, may I know what your sisters names are?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "They look similar to me and their names are Bolebole, Agari & Imuc.",
                        "Also say hi from me if you meet them, Pomoro!"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Mengabaikan nya dan melanjutkan perjalanan",
                "score": 25
            },
            {
                "text": "Menanyakan arah ",
                "score": 50
            },
            {
                "text": "Menyapa si jamur",
                "score": 75
            },
            {
                "text": "Memperkenalkan diri dan menanyakan arah ",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro gak terlalu memperhatikan manusia jamur tersebut dan melanjutkan perjalanan*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ifuly menyadari bahwa seseorang nampak mendekatinya, dan ia berlari masuk ke dalam rumahnya."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Menyapa si manusia jamur*",
                        "Hai..."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Ehh, emm.. Halo...",
                        "*Ifuly terlihat sangat malu dan masuk ke dalam rumahnya.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Menanyakan arah jalan.*",
                        "Permisi, apakah benar jalan ini bisa ke arah Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "... Halo, maafkan aku. Bisakah kamu ulang pertanyaannya? Barusan aku kurang memperhatikan."
                    ]
                },
                {
                    "position": -1,
                    "name": "id tba: Pomoro/You",
                    "text": [
                        "Tentu. Jadi aku ingin pergi ke Prospevil, apakah aku ada di jalan yang tepat?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Oh, Prospevil. Aku pikir sih sudah benar, tapi aku gak yakin.",
                        "Mungkin kamu bisa tanya salah satu adikku. Mereka pergi beberapa jam yang lalu."
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Memperkenalkan diri dan menanyakan arah jalan*",
                        "Halo, aku Pomoro. Apakah aku ada di jalur yang benar menuju Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Oh, hai Pomoro.",
                        "Maaf, aku kurang memperhatikan. Namaku Ifuly. Kalau kamu gak keberatan, boleh ulangi lagi pertanyaannya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Iya. Jadi aku mau ke Prospevil. Apakah aku sudah lewat jalur yang benar?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Oh, Prospevil. Aku pikir sih sudah benar. Tetapi untuk memastikan, kamu bisa tanya adikku kalau bertemu mereka.",
                        "Mereka sudah sering ke sana. Kalau aku baru beberapa kali saja."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, boleh aku tahu nama-nama saudarimu?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ifuly",
                    "text": [
                        "Mereka mirip denganku. Nama mereka Bolebole, Agari, dan Imuc.",
                        "Jangan lupa sampaikan salam dariku kalau ketemu mereka ya, Pomoro."
                    ]
                }
            ]
        ]
    },
    {
        "scene": 2,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_00_01_02",
        "background": "bg-sc_02",
        "intro_en":
        [
            "Upon venturing deep into the Vefurata forest, Pomoro discovers a carrot house on the cliff. He seems curious and went inside the carrot house.",
            "Once Pomoro arrived there, he saw a carrot humanoid."
        ],
        "intro_id":
        [
            "Setelah menjelajah jauh ke dalam hutan Vefurata, Pomoro menemukan sebuah rumah wortel di tebing. Dia tampak penasaran dan masuk ke dalam rumah wortel tersebut.",
            "Sesampainya Pomoro di sana, dia melihat seorang manusia wortel."
        ],
        "emotions_en":
        [
            {
                "text": "Bliss",
                "score": 25,
                "info": "Reaching a state of pure and profound happiness. This level of happiness transcends daily experiences and is often associated with  or transcendent moments of ecstasy and serenity.",
                "bullet_list": [
                    "State of pure happiness",
                    "True moment of ecstasy"
                ]
            },
            {
                "text": "Fulfillment",
                "score": 50,
                "info": "Achieving a deep sense of purpose and meaning in life. This level of happiness is attained when one's values, and aspirations align with their actions and accomplishments.",
                "bullet_list": [
                    "Deep sense of purpose or meaning",
                    "When values and goals align with accomplishments and actions"
                ]
            },
            {
                "text": "Contentment",
                "score": 75,
                "info": "State of inner peace and satisfaction that arises from embracing one's current circumstances without longing for more. It involves finding joy and fulfillment in the present moment, appreciating what one has, and letting go of the constant pursuit of external desires. Contentment allows individuals to experience a deep sense of tranquility and well-being, accepting life as it is and finding happiness within themselves.",
                "bullet_list": [
                    "Satisfied with current circumstances",
                    "Sense of thankfulness and acceptance"
                ]
            },
            {
                "text": "Excitement",
                "score": 100,
                "info": "State of heightened anticipation and enthusiasm that arises from the prospect of something new, thrilling, or engaging. It is characterized by a surge of energy and a sense of eager anticipation, often accompanied by feelings of joy or exhilaration. Excitement can be sparked by various experiences, such as upcoming events, adventures, achievements, or even the unknown, and it invigorates individuals by igniting a sense of curiosity, passion, and positive anticipation.",
                "bullet_list": [
                    "Heightened state of joy and enthusiasm",
                    "Sense of thrill or delight"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Bahagia",
                "score": 25,
                "info": "Mencapai keadaan kebahagiaan yang murni dan mendalam. Tingkat kebahagiaan ini melampaui pengalaman sehari-hari dan sering dikaitkan dengan atau momen transenden ekstasi dan ketenangan.",
                "bullet_list": [
                    "Merasakan Kebahagiaan yang sebenarnya",
                    "Merasa senang, gembira, riang yang luar biasa"
                ]
            },
            {
                "text": "Merasa Terpenuhi",
                "score": 50,
                "info": "Mencapai tujuan dan makna hidup yang mendalam. Tingkat kebahagiaan ini dicapai ketika nilai dan aspirasi seseorang selaras dengan tindakan dan pencapaian mereka.",
                "bullet_list": [
                    "Mengerti tujuan atau makna hidup dengan jelas",
                    "Ketika nilai dan tujuan selaras dengan pencapaian dan tindakan yang dilakukan"
                ]
            },
            {
                "text": "Merasa Bersyukur",
                "score": 75,
                "info": "Keadaan kedamaian dan kepuasan batin yang muncul dari merangkul keadaan saat ini tanpa merindukan lebih. Ini melibatkan menemukan kegembiraan dan kepuasan pada saat ini, menghargai apa yang dimiliki seseorang, dan melepaskan pengejaran terus-menerus dari keinginan eksternal. Kepuasan memungkinkan individu untuk mengalami rasa ketenangan dan kesejahteraan yang mendalam, menerima kehidupan apa adanya dan menemukan kebahagiaan dalam diri mereka sendiri.",
                "bullet_list": [
                    "Puas dengan keadaan saat ini",
                    "Perasaan bersyukur dan menerima keadaan"
                ]
            },
            {
                "text": "Gembira",
                "score": 100,
                "info": "Keadaan antisipasi dan antusiasme tinggi yang muncul dari prospek akan sesuatu yang baru, mendebarkan, atau menarik. Ini ditandai dengan gelombang energi dan rasa antisipasi yang bersemangat, sering kali disertai dengan perasaan senang atau gembira. Kegembiraan dapat dipicu oleh berbagai pengalaman, seperti peristiwa yang akan datang, petualangan, pencapaian, atau bahkan hal yang tidak diketahui, dan itu menyegarkan individu dengan memicu rasa ingin tahu, semangat, dan antisipasi positif.",
                "bullet_list": [
                    "Kegembiraan dan antusiasme yang tinggi",
                    "Rasa senang atau sukacita"
                ]
            }    
        ],


        "response_en":
        [
            {
                "text": "Feels a bit awkward or shy to ask and decides to continue on the journey",
                "score": 50
            },
            {
                "text": "Feels quite intrigued seeing the carrot and has a desire to start a conversation",
                "score": 75
            },
            {
                "text": "Decide to approach and greet the carrot to ask him for his inputs",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Feels a bit awkward or shy to ask and decides to continue on the journey.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "*Ota look sembarrassed and goes inside her house.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Feels quite intrigued seeing the carrot and has a desire to start a conversation*",
                        "Such a good day isn't it."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Yes! It's such a good day and I'm glad.",
                        "Alright, time to get to work.",
                        "*Ota swings his shovel, puts it on his right shoulder, and starts to leave his yard.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Decide to approach and greet the carrot to ask him for his inputs.*",
                        "Hello, it's such a good day isn't it."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Surely.. a day like this lifts up ones spirits. Where are you heading?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "I'm heading to Prospevil, have you been there before?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Ohh, Prospevil! Truly a very beautiful place that you are heading to.",
                        "We all lived near that area back then."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Wait, 'we all'? What do you mean?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Yeap. Naca, Daucu and I. Oh and I forgot to tell you, my name is Ota."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ahh, seems so nice having a tight-knit family. My name is Pomoro! It's a pleasure to meet you, Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Yes, pleasure to meet you too, Pomoro. Have a great day! I'm going to go to work!",
                        "*Ota swings his shovel, puts it on his right shoulder, and starts to leave his yard with a bright smile on his face.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro leaves with joy and with a smile on his face.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Agak canggung untuk bertanya, dan kembali melanjutkan perjalanan",
                "score": 50
            },
            {
                "text": "Memutuskan untuk mendekati dan menyapa si Wortel untuk untuk meminta nasihat/masukan darinya",
                "score": 75
            },
            {
                "text": "Penasaran dengan si wortel dan mencoba memulai percakapan",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Merasa agak canggung atau malu untuk bertanya dan memutuskan untuk melanjutkan perjalanan.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "*Ota terlihat malu dan langsung masuk ke rumahnya.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Merasa cukup tertarik melihat manusia wortel dan berkeinginan untuk memulai percakapan*",
                        "Hari yang cerah ya."
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Ya! Hari ini cerah dan aku senang.",
                        "Baik, waktunya untuk bekerja.",
                        "*Ota mengayunkan sekop, menaruhnya di atas pundak, dan mulai meninggalkan halamannya.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Memutuskan untuk mendekati dan menyapa si manusia wortel dan meminta masukan.*",
                        "Halo, hari ini indah sekali gak sih?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Ota",
                    "text": [
                        "Benar sekali.. Hari seperti ini bisa bikin orang semangat. Kamu mau ke mana?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Aku mau pergi ke Prospevil. Kamu pernah pergi ke sana ga?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Oh Prospevil! Tempat itu benar-benar indah loh.",
                        "Dulu kami tinggal di sekitar sana."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tunggu, “kami”? Apa maksud kamu?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Yap. Naca, Daucu, dan aku. Oh aku lupa memberitahumu, namaku Ota."
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ahh, kamu memiliki keluarga yang erat, terlihat begitu menyenangkan. Namaku Pomoro! Senang bertemu denganmu, Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Ota",
                    "text": [
                        "Iya, senang bertemu denganmu juga, Pomoro. Semoga harimu menyenangkan! Aku akan pergi bekerja!",
                        "*Ota mengayunkan sekop, menaruhnya di atas pundak, dan mulai meninggalkan halamannya dengan senyuman lebar di wajahnya.*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro pergi dengan gembira dan sebuah senyuman di wajahnya.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 3,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_03_04_05",
        "background": "bg-sc_03",
        "intro_en":
        [
            "Once he was back on his feet, he resumed his quest and reached the incline, filled with humid air.",
            "Pomoro saw some movement among the trees, and dared himself to investigate what that motion is.",
            "To his surprise, Pomoro saw a familiar sight. He saw three young mushrooms.",
            "It reminded him of Ifuly."
        ],
        "intro_id":
        [
            "Setelah mengumpulkan tenaga, Pomoro melanjutkan petualangannya dan sampai di tanjakan yang penuh dengan udara lembab.",
            "Pomoro melihat ada gerakan di balik pepohonan, lalu dia memberanikan diri untuk menyelidikinya.",
            "Terkejut, Pomoro melihat sesuatu yang tak asing, tiga manusia jamur.",
            "Mereka mengingatkannya pada Ifuly."
        ],
        "emotions_en":
        [
            {
                "text": "Imaginative Playfulness",
                "score": 25,
                "info": "Embracing creativity and imagination during play. This level of playfulness involves the exploration of imaginary worlds, storytelling, role-playing, or engaging with toys, props, or artistic activities. It encourages imaginative thinking, problem-solving, and the expression of one's inner world.",
                "bullet_list": [
                    "Playing using creativity and imagination",
                    "Explore imaginary worlds using storytelling"
                ]
            },
            {
                "text": "Adventurous Playfulness",
                "score": 50,
                "info": "Embracing a sense of adventure, exploration, and risk-taking play. This level of playfulness involves seeking new experiences, pushing boundaries, and engaging in challenging or thrilling activities. It often involves a spirit of curiosity, daring, and a willingness to  outside of one's comfort zone.",
                "bullet_list": [
                    "Exploring and risk-taking during play",
                    "Challenging and risky activities",
                    "Stepping out of comfort zone"
                ]
            },
            {
                "text": "Light Hearted Playfulness",
                "score": 75,
                "info": "A carefree and joyful state of being, characterized by a lighthearted attitude and a playful approach to life. It involves engaging in activities or interactions with a sense of spontaneity, humor, and a lack of seriousness. It often brings a sense of levity, laughter, and a refreshing break from the pressures and responsibilities of everyday life, allowing individuals to embrace their inner child and find happiness in the simple joys of the present moment.",
                "bullet_list": [
                    "Light-hearted humor and fun",
                    "Enjoying playtime in a casual and relaxed manner"
                ]
            },
            {
                "text": "Energetic Playfulness",
                "score": 100,
                "info": "Exhibiting a higher level of energy and enthusiasm during play. This level of playfulness involves more active and dynamic participation, such as engaging in physical activities, games, or playful competitions. It often involves a sense of excitement, movement, and vitality.",
                "bullet_list": [
                    "Energetic and enthusiastic",
                    "Engaging in physical activity",
                    "A lot of movement and excitement"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Ceria Yang Imajinatif",
                "score": 25,
                "info": "Merangkul kreativitas dan imajinasi selama bermain. Tingkat keceriaan ini melibatkan eksplorasi dunia imajiner, mendongeng, bermain peran, atau terlibat dengan mainan, properti, atau aktivitas artistik. Ini mendorong pemikiran imajinatif, pemecahan masalah, dan ekspresi dunia batin seseorang.",
                "bullet_list": [
                    "Bermain menggunakan kreatifitas dan imajinasi",
                    "Menjelajahi dunia imajiner menggunakan cerita-cerita imaginatif"
                ]
            },
            {
                "text": "Ceria Yang Eksploratif",
                "score": 50,
                "info": "Merangkul rasa petualangan, eksplorasi, dan permainan pengambilan risiko. Tingkat keceriaan ini melibatkan pencarian pengalaman baru, mendorong batasan, dan terlibat dalam aktivitas yang menantang atau mendebarkan. Ini sering melibatkan semangat keingintahuan, keberanian, dan kemauan untuk keluar dari zona nyaman seseorang.",
                "bullet_list": [
                    "Bereksplorasi dan mengambil risiko selama bermain",
                    "Kegiatan yang menantang dan berisiko",
                    "Melangkah keluar dari zona nyaman"
                ]
            },
            {
                "text": "Riang Tanpa Beban",
                "score": 75,
                "info": "Keadaan riang dan gembira, ditandai dengan sikap ringan dan pendekatan hidup yang menyenangkan. Ini melibatkan terlibat dalam kegiatan atau interaksi dengan rasa spontanitas, humor, dan kurangnya keseriusan. Itu sering membawa rasa kesembronoan, tawa, dan istirahat yang menyegarkan dari tekanan dan tanggung jawab kehidupan sehari-hari, memungkinkan individu untuk merangkul anak batin mereka dan menemukan kebahagiaan dalam kegembiraan sederhana saat ini.",
                "bullet_list": [
                    "Menikmati humor yang ringan dan menyenangkan",
                    "Menikmati waktu bermain dengan santai dan rileks"
                ]
            },
            {
                "text": "Ceria Yang Aktif",
                "score": 100,
                "info": "Menunjukkan tingkat energi dan antusiasme yang lebih tinggi selama bermain. Tingkat keceriaan ini melibatkan partisipasi yang lebih aktif dan dinamis, seperti terlibat dalam aktivitas fisik, permainan, atau kompetisi yang menyenangkan. Ini sering melibatkan rasa kegembiraan, gerakan, dan vitalitas.",
                "bullet_list": [
                    "Energik dan bersemangat",
                    "Terlibat dalam aktivitas fisik",
                    "Banyak sekali gerakan dan keceriaan"
                ]
            }  
        ],


        "response_en":
        [
            {
                "text": "Quickly go up to the three of them to ask them if they are related to Ifuly",
                "score": 50
            },
            {
                "text": "Wants to approach them modestly, wondering if they are Ifuly's younger sisters",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Quickly go up to the three of them to ask them if they are related to Ifuly.*",
                        "Hey, you guys look familiar!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Whattt?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "We all siblingsss"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "We are more than triplets!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole, Agari, Imuc",
                    "text": [
                        "*Together they gather and shout*",
                        "*Sister said we shouldn't talk to impolite people!*",
                        "*They go to other trees a few meters from there and start to play together again....*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro is shocked and they leave immediately.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Wants to approach them modestly, wondering if they are Ifuly's younger sisters.*",
                        "Excuse me, may I know if the three of you are Ifuly's sisters?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Wooo..?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "You met our big sister?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "How is she doing?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Well, she seems fine but a little bit shy. Anyway, she said hi to all of you. I think she is worried."
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Wait wait! Sister worry about us?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Ohh no! I want to play around first!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Don't worry, we'll be heading back later. Thanksfor letting us know!",
                        "Yes indeed she is a little bit shy, but she cares a lot about us"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So I have a question for all of you",
                        "Big sis says that you guys know the direction to Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Ayy, a Prospevil!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Prospevil... Just go straight ahead!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Yesss. Just go straight that is the rightdirection",
                        "We will head back to big sis later. Thank you!"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Bergegas berjalan menuju kepada ketiganya dan bertanya",
                "score": 50
            },
            {
                "text": "Menghampiri dengan sopan dan bertanya apakah mereka saudari Ifuly",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Buru-buru mendekati ketiganya untuk bertanya apakah mereka saudari Ifuly..*",
                        "Hey, kalian seperti tidak asing!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Apaaa?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Kami ini saudariiii."
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Kami lebih dari kembar tigaaa! Kami bukan kembar tiga biasaaa!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole, Agari, Imuc",
                    "text": [
                        "*Serentak, mereka berkumpul dan berteriak*",
                        "*Kakak bilang kami gak boleh bicara dengan orang yang kita tidak kenal*",
                        "*Mereka pergi ke pohon lain beberapa meter dari sana dan mulai bermain bersama lagi....*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro kaget dan si kembar tiga langsung pergi.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Ingin menghampiri mereka tanpa terlihat mencolok, penasaran apakah mereka adiknya Ifuly atau bukan.*",
                        "Permisi. Kalau boleh tahu, apakah kalian bertiga adiknya Ifuly?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Saapaahh..?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Kamu ketemu kakak kami?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Gimana kabarnya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Hmm, dia baik-baik aja, tapi agak sedikit pemalu. Ngomong-ngomong, Ifuly titip salam untuk kalian. Sepertinya dia khawatir."
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Tunggu, tunggu! Kakak mengkhawatirkan kami?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Oh tidak! Aku ingin bermain dulu!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Jangan khawatir, kami akan pulang nanti. Makasih sudah memberi tahu kami!",
                        "Betul dia memang pemalu, tapi dia peduli sekali ke kita."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Jadi aku punya pertanyaan untuk kalian",
                        "Kakak kalian bilang kalau kalian tahu arah jalan ke Prospevil?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Bolebole",
                    "text": [
                        "Yeeyyy, Prospevil!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Agari",
                    "text": [
                        "Prospevil... Tinggal lurus aja!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Imuc",
                    "text": [
                        "Iyaaa. Tinggal lurus, itu jalan yang benar.",
                        "Kami akan kembali ke rumah nanti. Makasih!"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 4,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_03_04_05",
        "background": "bg-sc_04",
        "intro_en":
        [
            "Pomoro sets off on his journey again. He managed to go through the forest, passing through various obstacles.",
            "When Pomoro nearly reached the edge of the forest, he heard something. He heard a rumble, but it's not the sound of a beast, nor thunder.",
            "Pomoro seems unsure but is curious to investigate the source of the sound.",
            "The sound is starting to get closer and closer, and to his surprise, Pomoro saw a Turnip Warrior."
        ],
        "intro_id":
        [
            "Pomoro melanjutkan perjalannya. Dia berhasil melintasi hutan dan melewati berbagai rintangan.",
            "Ketika Pomoro hampir mencapai tepi hutan, dia mendengar sesuatu. Bukan suara binatang maupun guntur, melainkan sebuah gemuruh.",
            "Pomoro terlihat tidak yakin tapi penasaran untuk menyelidiki sumber suara tersebut.",
            "Suara itu semakin mendekat, dan terkejut, Pomoro melihat seorang Kesatria Lobak."
        ],
        "emotions_en":
        [
            {
                "text": "Rage",
                "score": 25,
                "info": "Encountering an intense and uncontrollable anger that can lead to a loss of self-control. This level of anger is characterized by an explosive emotional outburst, accompanied by a heightened physical and psychological arousal. Rage can result in aggressive or destructive behavior.",
                "bullet_list": [
                    "Intense anger causing a loss of self control",
                    "Explosive emotional outburst",
                    "Can cause destructive behaviour"
                ]
            },
            {
                "text": "Irritation",
                "score": 50,
                "info": "Feeling a mild annoyance or frustration in response to a minor inconvenience or disruption. This level of anger is relatively low intensity and may arise from everyday irritants or inconveniences.",
                "bullet_list": [
                    "Mildly annoyed due to minor inconvenience",
                    "Lower intensity anger"
                ]
            },
            {
                "text": "Hostility",
                "score": 75,
                "info": "Exhibiting a strong antagonistic attitude or aggressive behavior towards someone or something. This level of animosity entails a more overt and confrontational stance, with a significant intent to harm, obstruct, or undermine the target.",
                "bullet_list": [
                    "Aggresive behaviour towards someone or something",
                    "Confrontational stance",
                    "Intended to harm the target"
                ]
            },
            {
                "text": "Anger",
                "score": 100,
                "info": "Experiencing a more pronounced emotional state of displeasure, often triggered by perceived injustices, conflicts, or violations of personal boundaries. This level of anger involves a stronger emotional response, including feelings of resentment, indignation, or frustration.",
                "bullet_list": [
                    "Stronger emotional response",
                    "Feeling of frustration and resentment"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Agresif",
                "score": 25,
                "info": "Menghadapi kemarahan yang intens dan tak terkendali yang dapat menyebabkan hilangnya kendali diri. Tingkat kemarahan ini ditandai dengan ledakan emosi yang meledak-ledak, disertai dengan peningkatan gairah fisik dan psikologis. Kemarahan dapat mengakibatkan perilaku agresif atau destruktif.",
                "bullet_list": [
                    "Perilaku agresif terhadap seseorang atau sesuatu",
                    "Sikap konfrontatif",
                    "Bermaksud untuk menyakiti target"
                ]
            },
            {
                "text": "Merasa Terganggu",
                "score": 50,
                "info": "Merasakan gangguan atau frustrasi ringan sebagai tanggapan atas ketidaknyamanan atau gangguan kecil. Tingkat kemarahan ini relatif rendah intensitasnya dan dapat timbul dari iritasi atau ketidaknyamanan sehari-hari.",
                "bullet_list": [
                    "Merasa terganggu karena merasa kurang nyaman",
                    "Kemarahan dengan intensitas rendah"
                ]
            },
            {
                "text": "Mengamuk",
                "score": 75,
                "info": "Menunjukkan sikap antagonis yang kuat atau perilaku agresif terhadap seseorang atau sesuatu. Tingkat permusuhan ini memerlukan sikap yang lebih terbuka dan konfrontatif, dengan maksud yang signifikan untuk menyakiti, menghalangi, atau merusak target.",
                "bullet_list": [
                    "Amarah yang kuat karena kehilangan kontrol",
                    "Ledakan emosi yang tiba-tiba",
                    "Dapat menyebabkan perilaku destruktif"
                ]
            },
            {
                "text": "Marah",
                "score": 100,
                "info": "Mengalami ketidaksenangan emosional yang lebih jelas, sering kali dipicu oleh anggapan ketidakadilan, konflik, atau pelanggaran batas-batas pribadi. Tingkat kemarahan ini melibatkan respons emosional yang lebih kuat, termasuk perasaan dendam, marah, atau frustrasi.",
                "bullet_list": [
                    "Respon emosional yang sangat kuat",
                    "Rasa frustrasi dan kebencian"
                ]
            } 
        ],


        "response_en":
        [
            {
                "text": "Not sure whether to be afraid or not, partly thinking that it may not be the best idea to approach",
                "score": 50
            },
            {
                "text": "Feel surprised seeing him on the high incline, decides to approach the turnip warrior",
                "score": 75
            },
            {
                "text": "Sees the turnip on a high incline, feel concerned and want to offer him help",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Not sure whether to be afraid or not, partly thinking that it may not be the best idea to approach*",
                        "*Pomoro leaves immediately*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Rapa heard something in a small voice, but then he ignored it"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Feel surprised seeing him on the high incline, decides to approach the turnip warrior.*",
                        "Wow, what are you doing in these lands? You seem troubled?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Rapa's madd. Angry! I was looking for Mupa, Mupo and Mupi."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Emm, Mu Ma Mo.. what?!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Hahh! There's no time to explain. They look like me",
                        "If you meet them, tell them to go here"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Wait up! I need to go to Prospevil."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Yes, good! So you can continue heading west, that is the direction to Prospevil.",
                        "And I'm heading to the East.",
                        "*Rapa rush to the East*"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro startled & bweildered*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Sees the turnip on a high incline, feel concerned and want to offer him help*",
                        "You seem troubled. May I help?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Argghh.. Mupa, Mupo and Mupi where are they!?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa, Mupo and Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Herrghh, all of my brothers, I can't find 'em",
                        "I'm lookin for 'em, but where are they now?",
                        "Aghh, If you happen to come across them, I'll be glad if you can tell them to go back here"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Wait up! I have to go to Prospevil.",
                        "But I'll tell them if I meet them along my journey."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Oh, so you want to go to Prospevil.",
                        "You can go to the West.",
                        "And I can go to the East.",
                        "Tell 'em I'm lookin for 'em if you meet 'em."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Sure thing, I'll let them know....",
                        "*Rapa and Pomoro go on separate directions.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Tidak yakin apakah harus takut atau tidak, dan enggan mendekat",
                "score": 50
            },
            {
                "text": "Terkejut melihatnya di tanjakan dan memutuskan untuk menghampiri",
                "score": 75
            },
            {
                "text": "Merasa khawatir dan ingin menawarkan bantuan padanya",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Tidak yakin apakah harus takut atau tidak. Di satu sisi berfikir bahwa mendekatinya bukanlah ide yang bagus*",
                        "*Pomoro segera pergi*"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Rapa mendengar sesuatu dari suara yang kecil, tapi kemudian dia mengabaikannya"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Merasa terkejut melihat kesatria lobak di tanjakan tinggi, memutuskan mendekatinya.*",
                        "Wow, kamu sedang apa di sini? Apakah kamu mengalami masalah?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Rapa marahhh. Sebal! Aku mencari Mupa, Mupo, dan Mupi."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ehh,Mu Ma Mo.. apa?!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Haa! Tidak ada waktu untuk menjelaskan. Mereka terluhat seperti aku.",
                        "Jika kamu bertemu mereka. Suruh mereka ke sini!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tunggu dulu! Aku harus ke Prosvepil."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Ya, bagus! Ikuti jalan ke arah Barat, kamu akan tiba di Prosvepil.",
                        "Dan aku akan pergi ke Timur.",
                        "Rapa bergegas pergi ke Timur"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro kaget & kebingungan*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Melihat lobak di tanjakan yang curam, merasa kasihan dan ingin menawarkan bantuan kepadanya*",
                        "Kamu sepertinya mengalami kendala. Perlu aku bantu?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Aarghhh.. Mupa, Mupo, dan Mupi, di mana mereka!?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa, Mupo, dan Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Huuahhhh, saudara-saudaraku, Aku tidak bisa menemukan mereka.",
                        "Aku mencari mereka, tapi di mana mereka sekarang?",
                        "Aahh, kalau kamu bertemu mereka, aku akan senang jika kamu bisa menyuruh mereka ke sini."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tunggu dulu! Aku harus pergi ke Prospevil.",
                        "Tapi aku akan beri tahu mereka kalau bertemu mereka di jalan."
                    ]
                },
                {
                    "position": 1,
                    "name": "Rapa",
                    "text": [
                        "Oh, jadi kamu ingin pergi ke Prospevil.",
                        "Kamu bisa pergi ke Barat.",
                        "Dan aku bisa pergi ke timur.",
                        "Beritahu mereka bahwa aku mencari mereka kalau kamu bertemu mereka"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Tentu, aku akan memberi tahu mereka......",
                        "*Rapa dan Pomoro pergi ke arah berlawanan.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 5,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_03_04_05",
        "background": "bg-sc_05",
        "intro_en":
        [
            "Once he was back on his feet, he resumed his quest and headed out to the forest.",
            "He passed a wide, green grass field with a pathway, and saw a couple of carrot humanoids resting under the tree beside the pathway."
        ],
        "intro_id":
        [
            "Setelah istirahat sejenak, dia melanjutkan perjalanan dan pergi ke arah hutan.",
            "Ia melewati jalan setapak di padang rumput yang hijau dan luas. Pomoro kemudian melihat sepasang manusia wortel beristirahat di bawah pohon di samping jalan setapak tersebut."
        ],
        "emotions_en":
        [
            {
                "text": "Fulfillment",
                "score": 25,
                "info": "Achieving a deep sense of purpose and meaning in life. This level of happiness is attained when one's values, and aspirations align with their actions and accomplishments.",
                "bullet_list": [
                    "Deep sense of purpose or meaning",
                    "When values and goals align with accomplishments and actions"
                ]
            },
            {
                "text": "Unstoppable Passion",
                "score": 50,
                "info": "Refers to an intense and unwavering drive or enthusiasm towards a particular pursuit or goal. It is characterized by a relentless determination, a burning desire, and a steadfast commitment to overcoming obstacles and achieving success. Unstoppable passion empowers individuals to persevere through challenges, fueling their actions with unwavering dedication and a refusal to be deterred, ultimately leading to the fulfillment of their ambitions.",
                "bullet_list": [
                    "Intense level of dedication and motivation",
                    "Full-on passion towards particular purpose",
                    "Pursuit if excellence and self-motivation"
                ]
            },
            {
                "text": "Moderate Drive",
                "score": 75,
                "info": "Experiencing a noticeable increase in motivation and determination. This level of incentive involves a stronger sense of purpose and focus, often fueled by external rewards, recognition, or a clear sense of progress towards a desired outcome.",
                "bullet_list": [
                    "Increase in motivation and determination",
                    "Strong sense of purpose and focus",
                    "Fueled by desired outcome"
                ]
            },
            {
                "text": "Excitement",
                "score": 100,
                "info": "Experiencing a heightened state of joy and enthusiasm. This level of happiness is characterized by a sense of anticipation, thrill, or delight.",
                "bullet_list": [
                    "Heightened state of joy and enthusiasm",
                    "Sense of thrill or delight"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Merasa Terpenuhi",
                "score": 25,
                "info": "Mencapai tujuan dan makna hidup yang mendalam. Tingkat kebahagiaan ini dicapai ketika nilai dan aspirasi seseorang selaras dengan tindakan dan pencapaian mereka.",
                "bullet_list": [
                    "Mengerti tujuan atau makna hidup dengan jelas",
                    "Ketika nilai dan tujuan selaras dengan pencapaian dan tindakan yang dilakukan"
                ]
            },
            {
                "text": "Semangat Membara",
                "score": 50,
                "info": "Mengacu pada dorongan atau antusiasme yang kuat dan tak tergoyahkan terhadap pengejaran atau tujuan tertentu. Ini ditandai dengan tekad yang tak kenal lelah, hasrat yang membara, dan komitmen yang teguh untuk mengatasi rintangan dan mencapai kesuksesan. Gairah yang tak terbendung memberdayakan individu untuk bertahan melalui tantangan, memicu tindakan mereka dengan dedikasi yang tak tergoyahkan dan penolakan untuk terhalang, yang pada akhirnya mengarah pada pemenuhan ambisi mereka.",
                "bullet_list": [
                    "Dedikasi dan motivasi yang kuat",
                    "Penuh gairah semangat untuk mencapai tujuan tertentu",
                    "Mengejar keunggulan dan motivasi diri"
                ]
            },
            {
                "text": "Dorongan Diri yang Cukup Kuat",
                "score": 75,
                "info": "Mengalami peningkatan motivasi dan tekad yang nyata. Tingkat insentif ini melibatkan rasa tujuan dan fokus yang lebih kuat, sering didorong oleh penghargaan eksternal, pengakuan, atau rasa kemajuan yang jelas menuju hasil yang diinginkan.",
                "bullet_list": [
                    "Motivasi dan tekad yang meningkat",
                    "Keyakinan akan tujuan dan fokus yang kuat",
                    "Didorong oleh keinginan mendapatkan hasil"
                ]
            },
            {
                "text": "Kegembiraan Yang Meluap-Luap",
                "score": 100,
                "info": "Mengalami keadaan kegembiraan dan antusiasme yang tinggi. Tingkat kebahagiaan ini ditandai dengan rasa antisipasi, sensasi, atau kegembiraan.",
                "bullet_list": [
                    "Kegembiraan dan antusiasme yang tinggi",
                    "Rasa senang atau sukacita"
                ]
            }
        ],


        "response_en":
        [
            {
                "text": "They seem familiar. Try and figure out who these two are",
                "score": 50
            },
            {
                "text": "Notice these two carrot humanoids, they seem to be related with Ota",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*They seem familiar. Try and figure out who these two are*",
                        "Woah, do I know you two?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Why why why? It's a good day for excitement, how do you know us?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Maybe maybe maybe. But how, when? Exciting isn't it, yes yes yes?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yeah, wait hmm… I forgot his name.",
                        "Erm...uu something? Oo.. Oott?",
                        "Ota???"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owh owh owh, Ota Ota Ota?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Big big big brother Ota, ya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yes, I think. He went to work with a bright smile on his face!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Surely surely surely, brother Ota always vibing with his smile every single day!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "No matter how hard the day is, big brother Ota always always always find reasons to smile."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yes, such a jolly  personality!",
                        "Okay then, gotta go. Have a great day."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "*Thank you thank you thank you. Have a pleasant day too!*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Notice these two carrot humanoids, they seem to be related with Ota*",
                        "Hey! You two look just like Ota!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owww, Ota Ota Ota? So you meet him somewhere, yes yes yes?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "How's big big big brother doing there?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Yeah, he seems fine. Also Ota seemed so happy when he went to work!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Always smiling so generously, brother Ota always smile no matter what!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "There's not a bad bad bad day for brother Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "It seems nice to know someone like him.",
                        "I would love to meet him again someday."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Surely surely surely, you may."
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "It's true true true, you can."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay then, it's a pleasure to meet the both of you.",
                        "Have a great day!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "*Yess yess yess. Have a great day too!*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Mengamati dua manusia wortel ini, mereka terlihat mirip dengan Ota",
                "score": 50
            },
            {
                "text": "Sepertinya tidak asing, coba mencari tahu siapa mereka",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Mereka terlihat familiar. Mencoba mencari tahu siapakah keduanya*",
                        "Wow, apakah kita pernah bertemu?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Napa napa napa? Ini hari yang pas untuk bergembira. Bagaimana kamu bisa kenal kami?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Bisa jadi bisa jadi. Tapi gimana? Kapan? Seru gak sih? Ya ya ya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, tunggu, hmm... Aku lupa namanya",
                        "Emm... Uu... Anu... Oo... Ota!",
                        "Ota???"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Wo o' ow, Ota Ota Ota?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Kakakaka Ota, ya?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya! Kalau gak salah sih. Dia pergi kerja dengan senyuman lebar di wajahnya!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Pasti pasti pasti. Ka Ota selalu bersemangat dengan senyumannya tiap hari!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Tak peduli sesulit apa, Ka Ota s'lalu s'lalu s'lalu bisa tersenyum."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ya, kepribadian yang riang!",
                        "Baiklah, aku harus pergi. Baik-baik ya."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "*Makasi makasi makasi. Baik-baik juga!*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Menyadari ada dua manusia wortel yang mirip dengan Ota*",
                        "Hey! Kalian berdua mirip Ota!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Owww, Ota Ota Ota? Jadi kamu pernah ketemu, ya ya ya?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Bagaimana kabar kakakakak?"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Dia sepertinya baik-baik saja. Ota juga terlihat sangat senang ketika pergi bekerja!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Selalu tersenyum ramah, Ka Ota selalu tersenyum!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Tak ada yang namanya hari hari hari buruk untuk Ka Ota."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Sepertinya menyenangkan bisa kenal orang seperti Ota.",
                        "Aku akan senang kalau bisa ketemu lagi dengannya."
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca",
                    "text": [
                        "Pasti pasti pasti."
                    ]
                },
                {
                    "position": 1,
                    "name": "Daucu",
                    "text": [
                        "Betul betul betul."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Baiklah, senang bertemu kalian.",
                        "Sampai jumpa!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Naca & Daucu",
                    "text": [
                        "*Yaa yaa yaaa. Sampai jumpa!*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 6,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_06_07_08",
        "background": "bg-sc_06_07_08",
        "intro_en":
        [
            "As Pomoro  leaves the area, he saw boulders along a small incline a few hundred meters ahead.",
            "Close to the first group of boulders, Pomoro saw turnip children."
        ],
        "intro_id":
        [
            "Selepas Pomoro meninggalkan area tersebut, dia melihat bebatuan besar di sepanjang lereng kecil beberapa ratus meter di depan.",
            "Tak jauh dari kumpuan batu terdekat, Pomoro melihat anak lobak."
        ],
        "emotions_en":
        [
            {
                "text": "Sorrow",
                "score": 25,
                "info": "Experiencing profound and long-lasting sadness that permeates various aspects of life. This level of sadness can be associated with prolonged grief, significant trauma, or  emotional pain. It may affect one's ability to function and require support to address and manage.",
                "bullet_list": [
                    "Long lasting sadness that affects one's life",
                    "Chronic emotional pain and grief"
                ]
            },
            {
                "text": "Mild Remorse",
                "score": 50,
                "info": "Feeling a slight sense of guilt or regret in response to a minor wrongdoing or a perceived violation of personal values. This level of guilt is relatively low intensity and may involve a sense of unease, self-reflection, or the recognition of a minor mistake.",
                "bullet_list": [
                    "Slight sense of guilt due to minor wrongdoings",
                    "Lower intensity, usually involves self-reflection"
                ]
            },
            {
                "text": "Disappointment",
                "score": 75,
                "info": "Feeling let down or dissatisfied due to unmet expectations or unfavorable outcomes. This level of sadness is typically milder and temporary, often related to specific events or circumstances.",
                "bullet_list": [
                    "Feeling let down due to bad outcomes",
                    "Temporary sadness due to specific circumstances"
                ]
            },
            {
                "text": "Moderate Guilt",
                "score": 100,
                "info": "Experiencing a more pronounced level of guilt, often accompanied by a stronger sense of responsibility for a perceived wrongdoing. This level of guilt involves a deeper  response, such as feelings of remorse, shame, or self-blame, and may motivate efforts to make amends or seek forgiveness.",
                "bullet_list": [
                    "Feel quite remorseful",
                    "Wanna make efforts to make amends",
                    "Stronger responsibility for wrongdoing"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Pilu",
                "score": 25,
                "info": "Mengalami kesedihan yang mendalam dan bertahan lama yang menembus berbagai aspek kehidupan. Tingkat kesedihan ini dapat dikaitkan dengan kesedihan yang berkepanjangan, trauma yang signifikan, atau rasa sakit emosional. Ini dapat memengaruhi kemampuan seseorang untuk berfungsi dan membutuhkan dukungan untuk mengatasi dan mengelolanya.",
                "bullet_list": [
                    "Kesedihan panjang dan lama yang dapat mempengaruhi hidup seseorang",
                    "Rasa sakit dan kesedihan emosional yang akut"
                ]
            },
            {
                "text": "Sedikit Menyesal",
                "score": 50,
                "info": "Merasakan sedikit rasa bersalah atau penyesalan sebagai tanggapan atas kesalahan kecil atau pelanggaran nilai-nilai pribadi yang dirasakan. Tingkat rasa bersalah ini relatif rendah dan mungkin melibatkan rasa tidak nyaman, refleksi diri, atau pengakuan kesalahan kecil .",
                "bullet_list": [
                    "Merasa sedikit bersalah karena kesalahan kecil",
                    "Penyesalan yang intensitas nya lebih rendah, kadang melibatkan refleksi diri juga"
                ]
            },
            {
                "text": "Kecewa",
                "score": 75,
                "info": "Merasa kecewa atau tidak puas karena harapan yang tidak terpenuhi atau hasil yang tidak diinginkan. Tingkat kesedihan ini biasanya lebih ringan dan sementara, seringkali terkait dengan kejadian atau keadaan tertentu.",
                "bullet_list": [
                    "Merasa kecewa karena hasil yang buruk",
                    "Kesedihan sementara karena keadaan tertentu"
                ]
            },
            {
                "text": "Merasa Bersalah",
                "score": 100,
                "info": "Mengalami tingkat rasa bersalah yang lebih jelas, seringkali disertai dengan rasa tanggung jawab yang lebih kuat atas kesalahan yang dirasakan. Tingkat rasa bersalah ini melibatkan respons yang lebih dalam, seperti perasaan menyesal, malu, atau menyalahkan diri sendiri, dan dapat memotivasi upaya untuk membuat memperbaiki atau meminta pengampunan.",
                "bullet_list": [
                    "Ada rasa penyesalan",
                    "Ingin melakukan beberapa upaya untuk menebus kesalahan",
                    "Rasa tanggung jawab yang besar atas kesalahan"
                ]
            }
        ],


        "response_en":
        [
            {
                "text": "Call on the three of them from afar",
                "score": 50
            },
            {
                "text": "Come up to them to inquire further",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Call on the three of them from afar*",
                        "Wait, are they the ones who Rapa is looking for?",
                        "Hey, are you Mupa, Mupo, or Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Ohh no no no! I shouldn't have told them to go up there, haaa..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Hey, what's going on?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Mupa is very very sorry"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Where is Mupi & Mupo?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "They are up there on the boulder."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay, you go head back to Rapa. I'll check those two."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "I'm so sorry, thank you"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro steps up to another boulder while approaching Mupo & Mupi.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Come up to them to inquire further*",
                        "Hello, I'm Pomoro. Do you know Rapa? I thought you know Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Hah. I shouldn't have done that. Oh hi, I'm Mupa."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "What happened?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "I shouldn't have told 'em to chase the higher ground. And now they are up there on the boulder."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So, they are Mupo & Mupi, on the top of the another boulder?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Yeah,. we shouldn't have played that far actually."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay okay, relax. I'll head over to those two. You can go head back to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "So sorry. Thank you Pomoro."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro steps up to another boulder while approaching Mupi and Mupo.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Memanggil mereka dari kejauhan",
                "score": 50
            },
            {
                "text": "Mendatangi mereka untuk bertanya lebih lanjut",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Memanggil ketiganya dari kejauhan*",
                        "Tunggu, apakah yang dicari Rapa adalah mereka ini?",
                        "Hei, apa kalian Mupa, Mupo, dan Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Oh tidak! Aku harusnya gak memberitahu mereka untuk pergi ke sana, haaa"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Hey, ada apa?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Mupa sangat sangat minta maaf"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Di mana Mupo dan Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Mereka di atas batu sana."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Oke, kamu pulang ya, temui Rapa. Mereka berdua akan aku periksa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Maaf sekali. Makasih ya."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro memanjat batu besar tersebut untuk mendekati Mupo dan Mupi.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Menghampiri mereka untuk bertanya lebih lanjut*",
                        "Halo, aku Pomoro. Kamu tahu Rapa gak? Sepertinya kamu kenal."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Hah, harusnya aku gak melakukannya. Oh hai, aku Mupa."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ada apa?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Aku harusnya gak menyuruh mereka untuk ke tempat yang lebih tinggi. Jadinya sekarang mereka ada di atas bebatuan besar itu."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        " Jadi mereka yang di atas batuan itu Mupo dan Mupi?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Iya. Kami harusnya gak bermain-main sejauh itu."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Oke oke, tenang. Aku akan hampiri mereka berdua. Kamu bisa pulang duluan ke si Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupa",
                    "text": [
                        "Maaf sekali. Makasih Pomoro."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Pomoro menaiki bebatuan untuk mendekati Mupo dan Mupi.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 7,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_06_07_08",
        "background": "bg-sc_06_07_08",
        "intro_en":
        [
            "Pomoro hikes up boulder by boulder to reach Mupi and finally stands on the same boulder as Mupi."
        ],
        "intro_id":
        [
            "Pomoro mendaki batu demi batu untuk mendekati Mupi. Pomoro akhirnya berdiri di atas batu yang sama dengan Mupi."
        ],
        "emotions_en":
        [
            {
                "text": "Paralyzing Remorse",
                "score": 25,
                "info": "Experiencing an extreme and debilitating level of guilt that significantly impacts one's emotional well-being and daily functioning. This level of guilt is associated with intense and persistent self-blame, overwhelming shame, or a profound sense of unworthiness. It may lead to a loss of self-esteem, withdrawal from social interactions.",
                "bullet_list": [
                    "Extreme level of guilt that affects daily functioning",
                    "Intense self-blame or sense of unworthiness"
                ]
            },
            {
                "text": "Terror",
                "score": 50,
                "info": "Experiencing an extreme and paralyzing level of fear that overwhelms the individual's ability to think or act rationally. This level of fear is associated with an imminent or perceived life-threatening situation and can be accompanied by a complete loss of control or a sense of extreme danger. It often triggers a fight-or-flight response.",
                "bullet_list": [
                    "Extreme fear that makes people unable to think rationally",
                    "Complete loss of control in a situation of danger"
                ]
            },
            {
                "text": "Panic",
                "score": 75,
                "info": "Experiencing heightened apprehension, restlessness, or worry about potential future events or uncertain outcomes. This level of fear can be persistent and may affect daily functioning, leading to feelings of nervousness or uneasiness.",
                "bullet_list": [
                    "Intense fear response",
                    "Could usually cause faster heartbeat or shortness of breath"
                ]
            },
            {
                "text": "Anxiety",
                "score": 100,
                "info": "Encountering an intense and overwhelming fear response characterized by a sudden onset of extreme distress. This level of fear is often accompanied by physical symptoms such as rapid heartbeat, shortness of breath, or a sense of impending doom. Panic can impair judgment and may require immediate attention and intervention.",
                "bullet_list": [
                    "Heightened sense of restlessness or worry about the future",
                    "Feeling nervous or uneasy"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Penyesalan Mendalam",
                "score": 25,
                "info": "Mengalami tingkat rasa bersalah yang ekstrem dan melemahkan yang secara signifikan memengaruhi kesejahteraan emosional dan fungsi sehari-hari seseorang. Tingkat rasa bersalah ini dikaitkan dengan menyalahkan diri sendiri yang intens dan terus-menerus, rasa malu yang berlebihan, atau rasa tidak berharga yang mendalam. Ini dapat menyebabkan hilangnya harga diri, penarikan diri dari interaksi sosial.",
                "bullet_list": [
                    "Rasa bersalah yang ekstrem yang memengaruhi fungsi sehari-hari",
                    "Menyalahkan diri sendiri atau merasa seperti orang yang tidak berharga"
                ]
            },
            {
                "text": "Amat Ketakutan",
                "score": 50,
                "info": "Mengalami tingkat ketakutan yang ekstrim dan melumpuhkan yang menguasai kemampuan individu untuk berpikir atau bertindak secara rasional. Tingkat ketakutan ini dikaitkan dengan situasi yang mengancam jiwa yang akan segera terjadi atau dirasakan dan dapat disertai dengan kehilangan kendali sepenuhnya atau rasa bahaya yang ekstrim. Ini sering memicu respons melawan-atau-lari.",
                "bullet_list": [
                    "Ketakutan ekstrim yang membuat orang tidak bisa berpikir rasional",
                    "Benar-benar kehilangan kendali dalam situasi yang berbahaya"
                ]
            },
            {
                "text": "Panik",
                "score": 75,
                "info": "Mengalami ketakutan yang meningkat, kegelisahan, atau kekhawatiran tentang potensi kejadian di masa depan atau hasil yang tidak pasti. Tingkat ketakutan ini bisa terus-menerus dan dapat memengaruhi fungsi sehari-hari, menyebabkan perasaan gugup atau tidak nyaman.",
                "bullet_list": [
                    "Rasa takut yang intens",
                    "Bisa menyebabkan detak jantung menjadi lebih cepat atau sesak napas"
                ]
            },
            {
                "text": "Cemas",
                "score": 100,
                "info": "Menghadapi respons ketakutan yang intens dan luar biasa yang ditandai dengan serangan tiba-tiba dari tekanan ekstrem. Tingkat ketakutan ini sering kali disertai dengan gejala fisik seperti detak jantung yang cepat, sesak napas, atau perasaan akan datangnya malapetaka. Kepanikan dapat merusak penilaian dan mungkin memerlukan perhatian dan intervensi segera.",
                "bullet_list": [
                    "Meningkatnya rasa gelisah atau khawatir tentang masa depan",
                    "Merasa gugup atau gelisah"
                ]
            }
        ],


        "response_en":
        [
            {
                "text": "Approach him and tell him to get down from the high boulder",
                "score": 50
            },
            {
                "text": "Gently approach him and persuade him to be careful and come down",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Approach him and tell him to get down from the high boulder*",
                        "Hey! Get down, it's dangerous up there!"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Huaaa, Mupo won't get down. Mupo can't go down, Mupi too scared!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay okay. you don't have to look down, Mupo.. Wait, are you Mupi or Mupo?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Ooo, okay. I'm Mupi. But Mupo is still up there."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So now we will go down from this boulder, okay? And go to Rapa after we landed."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Sss, sss.. suree..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Guided Mupi get down then go back to come over Mupo.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Gently approach him and persuade him to be careful and come down*",
                        "Hey, hey. Are you Mupo or Mupi. Mupa said we need to get down. Rapa is looking for you too."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Huaaa, Mupo wont get down. Mupi can't go down, too high, too scared.."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Okay okay. You don't have to look down, Mupi. So you are Mupi? Is that correct?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Ooo, ookayy.. Yes, I'm Mupi. But Mupo is still up there."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "So now we will go down from this boulder, okay? And go to Rapa after we landed."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Sss, sss.. Suree..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Helps Mupi get down and then go back to help Mupo.*"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Mendekati dan memintanya turun dari batu besar yang cukup tinggi",
                "score": 50
            },
            {
                "text": "Mendekatinya dengan lembut dan membujuknya untuk turun dengan hati-hati",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Mendekati Mupi dan menyuruhnya untuk turun dari batuan besar*",
                        "Hei! Ayo turun, bahaya kamu."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Huwaa, Mupo gak mau turun. Mupi gak bisa turun, takut!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Oke oke. Kamu jangan lihat ke bawah, Mupo. Eh tunggu, kamu Mupo atau Mupi, sih?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Ooo, oke. Aku Mupi. Tapi Mupo masih di atas sana."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Kita turun dari batu ini lalu pulang kembali ke Rapa ya.."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "I i i, iyaa..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Memandu Mupi untuk turun, lalu kembali lagi ke atas menghampiri Mupo.*"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Mendekatinya dengan perlahan, dan membujuknya untuk turun dengan hati-hati*",
                        "Hei, hei. Kamu Mupo atau Mupi? Mupa bilang kita perlu turun. Rapa juga sedang mencari kalian."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Huwaaa, Mupo gak mau turun. Mupi gak bisa turun, terlalu tinggi, takut."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Oke oke. Kamu jangan lihat ke bawah, Mupo. Eh kamu Mupo ya kan?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Ooo, okee.. Iya, aku Mupi. Tapi Mupi masih di atas sana.."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Ayo kita turun dulu. Lalu kamu pulang ke si Rapa ya."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupi",
                    "text": [
                        "Bbb ba, baiik..."
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Membantu Mupi turun dan kembali ke atas untuk menolong Mupo.*"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 8,
        "has_quest": true,
        "audio": "bgm-emotion_understanding-sc_06_07_08",
        "background": "bg-sc_06_07_08",
        "intro_en":
        [
            "After Mupi managed to get down, Pomoro continued to climb the highest boulder, finally reaching Mupo.",
            "Mupo stood proudly with confidence where he looked so dignified on the sloppy boulder surface."
        ],
        "intro_id":
        [
            "Setelah Mupi turun, Pomoro kembali memanjat batuan tertinggi dan akhirnya sampai di tempat Mupo.",
            "Mupo berdiri dengan bangga dan percaya diri di mana dia tampak begitu berwibawa di permukaan batu yang berantakan."
        ],
        "emotions_en":
        [
            {
                "text": "Legacy",
                "score": 25,
                "info": "Encountering a profound and lasting sense of pride derived from making a meaningful impact or leaving a positive mark on the world. This level of pride is associated with significant contributions, acts of service, or accomplishments that have a lasting influence beyond one's immediate sphere. It reflects a sense of purpose, contribution, and a desire to create a lasting legacy",
                "bullet_list": [
                    "Pride left after leaving a positive mark on the world",
                    "Contribution that creates a lasting legacy"
                ]
            },
            {
                "text": "Validation",
                "score": 50,
                "info": "Experiencing a deeper level of pride that arises from the affirmation of one's identity, values, or beliefs. This level of pride reflects a sense of self-acceptance and authenticity, often linked to personal growth, embracing one's uniqueness, or standing up for what one believes in.",
                "bullet_list": [
                    "Sense of self-acceptance and authenticity",
                    "External praise and validation from others"
                ]
            },
            {
                "text": "Accomplishment",
                "score": 75,
                "info": "Feeling a sense of pride and satisfaction in achieving a personal goal, completing a task, or overcoming a challenge. This level of pride is associated with a specific accomplishment and reflects a sense of fulfillment and self-worth.",
                "bullet_list": [
                    "Sense of pride or satisfaction in overcoming a challenge",
                    "Fulfillment and self-worth"
                ]
            },
            {
                "text": "Recognition",
                "score": 100,
                "info": "Experiencing pride in being acknowledged or recognized for one's achievements or contributions. This level of pride involves external validation, such as receiving awards, accolades, or praise from others, and it reinforces a sense of accomplishment and value.",
                "bullet_list": [
                    "Pride being recognized for achievements",
                    "External praise and validation from others"
                ]
            }

        ],
        "emotions_id":
        [
            {
                "text": "Meninggalkan Warisan Diri",
                "score": 25,
                "info": "Menghadapi rasa bangga yang mendalam dan bertahan lama yang berasal dari membuat dampak yang berarti atau meninggalkan jejak positif di dunia. Tingkat kebanggaan ini diasosiasikan dengan kontribusi yang signifikan, tindakan pelayanan, atau pencapaian yang memiliki pengaruh abadi di luar jangkauan langsung seseorang. Itu mencerminkan rasa tujuan, kontribusi, dan keinginan untuk menciptakan warisan abadi",
                "bullet_list": [
                    "Perasaan bangga setelah memberikan warisan positif kepada dunia",
                    "Kontribusi yang akan bermanfaat terus menerus"
                ]
            },
            {
                "text": "Validasi Diri",
                "score": 50,
                "info": "Mengalami tingkat kebanggaan yang lebih dalam yang muncul dari penegasan identitas, nilai, atau keyakinan seseorang. Tingkat kebanggaan ini mencerminkan rasa penerimaan diri dan keaslian, sering dikaitkan dengan pertumbuhan pribadi, merangkul keunikan seseorang, atau mempertahankan apa yang diyakini seseorang.",
                "bullet_list": [
                    "Penerimaan penuh atas semua yang ada pada dirinya - seperti apa adanya",
                    "Merangkul keunikan diri sendiri dan membela apa yang diyakininya"
                ]
            },
            {
                "text": "Merasakan Pencapaian",
                "score": 75,
                "info": "Merasakan rasa bangga dan puas dalam mencapai tujuan pribadi, menyelesaikan tugas, atau mengatasi tantangan. Tingkat kebanggaan ini dikaitkan dengan pencapaian tertentu dan mencerminkan rasa pemenuhan dan harga diri.",
                "bullet_list": [
                    "Rasa kebanggaan atau kepuasan dalam mengatasi suatu tantangan",
                    "Rasa kepuasan dan kebanggaan pada diri sendiri"
                ]
            },
            {
                "text": "Merasa Diakui",
                "score": 100,
                "info": "Mengalami kebanggaan karena diakui atau diakui atas pencapaian atau kontribusi seseorang. Tingkat kebanggaan ini melibatkan validasi eksternal, seperti menerima penghargaan, pujian, atau pujian dari orang lain, dan ini memperkuat rasa pencapaian dan nilai.",
                "bullet_list": [
                    "Bangga karena prestasinya diakui",
                    "Suka dipuji dan mendapatkan pengakuan dari orang lain"
                ]
            }
        ],


        "response_en":
        [
            {
                "text": "Talk to Mupo and order him to come down",
                "score": 50
            },
            {
                "text": "Tell Mupo to be careful and warn him of the dangers of standing on top of that boulder",
                "score": 100
            }
        ],
        "response_en_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Talk to Mupo and order him to come down*",
                        "Mupo, can you please get down, it's very dangerous here! You got to be really careful."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Mupo is on top of the world! No one can stop Mupooo!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupo, you are on a high and slippery boulder, can you please get down now?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "I'm on the highest peak!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa and Mupi are waiting for you to come to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Uhhh Rapa? Yess protecta family back and forth.",
                        "Okay, I'll go back to Rapa's place. Of I go to another high place, thanks!"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Tell Mupo to be careful and warn him of the dangers of standing on top of that boulder.*",
                        "Mupo, be careful there, it's dangerous. You're standing on a sloppy boulder."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Mupo is on top of the world, no one can stop Mupooo!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupo, could you please get down now?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "I'm on the highest peak!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa and Mupi waiting you come to Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Uhhh Rapa? Yes, protect family back and forth.",
                        "Okay, I'll go back to Rapa's place. Of I go to another high place, thanks!"
                    ]
                }
            ]
        ],


        "response_id":
        [
            {
                "text": "Memberi tahu Mupi untuk berhati- hati dan memperingatkan tentang bahayanya",
                "score": 50
            },
            {
                "text": "Berbicara pada Mupi dan memerintahkannya untuk turun",
                "score": 100
            }
        ],
        "response_id_contexts":
        [
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Bicara pada Mupo dan menyuruhnya untuk turun*",
                        "Mupo, tolong turun ya, ini bahaya sekali. Kamu harus sangat berhati-hati."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Mupo ada di atas dunia! Tidak ada yang bisa menghentikan Mupooo!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupo, kamu ada di atas batu tinggi yang berantakan. Ayo tolong segera turun."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Aku sedang berada di puncak tertinggi!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa dan Mupi sedang menunggu kamu untuk pulang ke Rapa loh."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Haa Rapa? Uhhh Rapa? Yaa dia pelindung keluarga.",
                        "Oke, aku akan kembali ke tempat Rapa. Pastinya aku bisa pergi ke tempat-tempat tinggi lainnya lain kali, terima kasih!"
                    ]
                }
            ],
            [
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "*Beritahu Mupo untuk berhati-hati dan memperingatkannya akan bahaya berdiri di atas batu besar tersebut.*",
                        "Mupo, hati-hati, bahaya. Kamu berdiri di atas batu yang licin."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Mupo berada di atas dunia! Tidak ada yang bisa menghentikan Mupo!!!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupo, bisa tolong turun sekarang?"
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Aku berada di puncak tertinggi!"
                    ]
                },
                {
                    "position": -1,
                    "name": "Pomoro/You",
                    "text": [
                        "Mupa dan Mupi sedang menunggu kamu untuk pulang ke Rapa."
                    ]
                },
                {
                    "position": 1,
                    "name": "Mupo",
                    "text": [
                        "Hah Rapa? Iya, dia pelindung keluarga.",
                        "Oke, aku akan kembali ke tempat Rapa. Pastinya aku pergi ke tempat-tempat tinggi lainnya, terima kasih!"
                    ]
                }
            ]
        ]
    },
    {
        "scene": 9,
        "has_quest": false,
        "audio": "bgm-emotion_understanding-sc_09",
        "background": "bg-sc_09",
        "intro_en":
        [
            "After some time, Pomoro continues on his way, and resumes his advantures.",
            "A few miles after leaving the boulders along the pathway, Pomoro saw a large village surrounded by rivers, green grass fields, and formidable walls.",
            "A few miles after leaving the boulders along the pathway, Pomoro saw a large village surrounded by rivers, green grass fields, and formidable walls.",
            "There after, Pomoro stands underneath the village gate. He realized that his journey gave him so many experiences and allowed him to encounter many different people in different unique situations.",
            "From then on, Pomoro continued to learn many things along his journey, driven by curiosity and courage."
        ],
        "intro_id":
        [
            "Setelah beberapa lama, Pomoro melanjutkan perjalanannya.",
            "Beberapa kilometer setelah melewati jalan dengan batu-batu besar, Pomoro melihat desa yang besar dikelilingi sungai, ladang rumput yang hijau, dan benteng yang kokoh.",
            "Lalu, Pomoro berdiri di bawah gerbang desa. Dia menyadari bahwa perjalanan yang ia lalui telah memberikannya banyak pengalaman menemui berbagai orang di berbagai situasi yang unik.",
            "Sejak saat itu, Pomoro lanjut mempelajari berbagai hal selama perjalanan yang didorong oleh rasa penasaran dan keberanian."
        ],
        "emotions_en": [],
        "emotions_id": [],
        "response_en": [],
        "response_id": [],
        "response_en_contexts": [],
        "response_id_contexts": []
    }
]